Repository: autotools-mirror/gettext
Catalog: po/*.po
Languages: cs

source: Unknown system error
cs: Neznámá systémová chyba

source: %s: option `%s' is ambiguous
cs: %s: pøepínaè `%s' není jednoznaèný

source: %s: option `--%s' doesn't allow an argument
cs: %s: pøepínaè `--%s' musí být zadán bez argumentu

source: %s: option `%c%s' doesn't allow an argument
cs: %s: pøepínaè `%c%s' musí být zadán bez argumentu

source: %s: option `%s' requires an argument
cs: %s: pøepínaè `%s' vy¾aduje argument

source: %s: unrecognized option `--%s'
cs: %s: neznámý pøepínaè `--%s'

source: %s: unrecognized option `%c%s'
cs: %s: neznámý pøepínaè `%c%s'

source: %s: illegal option -- %c
cs: %s: neznámý pøepínaè -- %c

source: %s: invalid option -- %c
cs: %s: neznámý pøepínaè -- %c

source: %s: option requires an argument -- %c
cs: %s: pøepínaè vy¾aduje argument -- %c

source: %s: option `-W %s' is ambiguous
cs: %s: pøepínaè `-W %s' není jednoznaèný

source: %s: option `-W %s' doesn't allow an argument
cs: %s: pøepínaè ` -W %s' musí být zadán bez argumentu

source: Copyright (C) %s Free Software Foundation, Inc. This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
cs: Copyright (C) %s Free Software Foundation, Inc. Toto je volné programové vybavení; podmínky pro kopírování a roz¹iøování naleznete ve zdrojových textech. Toto programové vybavení je zcela BEZ ZÁRUKY, a to i bez záruky PRODEJNOSTI nebo VHODNOSTI PRO NÌJAKÝ KONKRÉTNÍ ÚÈEL.

source: Written by %s.
cs: Autor: %s

source: too many arguments
cs: pøíli¹ mnoho argumentù

source: missing arguments
cs: chybí argumenty

source: Try `%s --help' for more information.
cs: Více informací získáte pøíkazem `%s --help'.

source: Usage: %s [OPTION] [[[TEXTDOMAIN] MSGID] | [-s [MSGID]...]] -d, --domain=TEXTDOMAIN retrieve translated messages from TEXTDOMAIN -e enable expansion of some escape sequences -E (ignored for compatibility) -h, --help display this help and exit -n suppress trailing newline -V, --version display version information and exit [TEXTDOMAIN] MSGID retrieve translated message corresponding to MSGID from TEXTDOMAIN
cs: Pou¾ití: %s [PØEPÍNAÈ] [[[TEXTOVÁDOMÉNA] MSGID ] | [-s [MSGID]...]] -d, --domain=TEXTOVÁDOMÉNA nastaví textovou doménu, ze které je MSGID -e umo¾ní expanzi nìkterých escape sekvencí -E (ignorován - kvùli kompatibilitì) -h, --help vypí¹e tuto nápovìdu a ukonèí se -n potlaèí nové øádky na konci zprávy -V, --version vypí¹e oznaèení verze a ukonèí se [TEXTOVÁDOMÉNA] MSGID vypí¹e pøelo¾enou zprávu odpovídající MSGID z TEXTOVÉDOMÉNY

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. When used with the -s option the program behaves like the `echo' command. But it does not simply copy its arguments to stdout. Instead those messages found in the selected catalog are translated. Standard search directory: %s
cs: Není-li zadán argument TEXTOVÁDOMÉNA, pak je doména získána z promìnné prostøedí TEXTDOMAIN. Jestli¾e katalog se zprávami není nalezen v pøedpokládaném adresáøi, pak je tento katalog hledán v adresáøi, zadaném v promìnné prostøedí TEXTDOMAINDIR. Je-li pou¾it argument -s, program se chová jako pøíkaz `echo'. Místo toto, aby pouze kopíroval svoje argumenty do stdout, vypí¹e pøeklad zpráv ze zvoleného katalogu. Standardní prohledávaný adresáø: %s

source: Report bugs to <bug-gnu-utils@gnu.org>.
cs: Chyby v programu oznamujte na adrese <bug-gnu-utils@prep.ai.mit.edu> (pouze anglicky), pøipomínky k pøekladu zasílejte na adresu <cs@li.org> (èesky).

source: no input files given
cs: vstupní soubory nejsou zadány

source: exactly 2 input files required
cs: jsou po¾adovány pøesnì 2 vstupní soubory

source: Usage: %s [OPTION] def.po ref.po Mandatory arguments to long options are mandatory for short options too. -D, --directory=DIRECTORY add DIRECTORY to list for input files search -h, --help display this help and exit -V, --version output version information and exit Compare two Uniforum style .po files to check that both contain the same set of msgid strings. The def.po file is an existing PO file with the old translations. The ref.po file is the last created PO file (generally by xgettext). This is useful for checking that you have translated each and every message in your program. Where an exact match cannot be found, fuzzy matching is used to produce better diagnostics.
cs: Pou¾ití: %s [PØEPÍNAÈ] def.po ref.po Argumenty po¾adované dlouhými pøepínaèi, jsou také po¾adovány jejich krátkými formami. -D, --directory=ADRESÁØ pøidá ADRESÁØ do seznamu pro hledání vstupních souborù -h, --help vypí¹e tuto nápovìdu a ukonèí se -V, --version vypí¹e oznaèení verze a ukonèí se Porovná dva .po soubory stylu Uniforum a zkontroluje, zda oba obsahují stejnou mno¾inu msgid øetìzcù. Soubor def.po je existující PO soubor se starým pøekladem. Soubor ref.po je naposledy vytvoøený PO soubor (obvykle programem xgettext). To je u¾iteèné pro kontrolu, ¾e máte pøelo¾enu ka¾dou zprávu ve va¹em programu. Pokud pøi porovnávání nejsou zprávy pøesnì shodné, zkoumá se, zda si nejsou podobné (fuzzy).

source: this message is used but not defined...
cs: tato zpráva je pou¾ita, ale nikoli definována...

source: ...but this definition is similar
cs: ...ale tato definice je podobná

source: this message is used but not defined in %s
cs: tato zpráva je pou¾ita, ale nikoli definována v %s

source: warning: this message is not used
cs: varování: tato zpráva není pou¾ita

source: duplicate message definition
cs: dvojnásobná definice zprávy

source: ...this is the location of the first definition
cs: ...toto je umístìní první definice

source: this message has no definition in the "%s" domain
cs: tato zpráva nemá ¾ádnou definici v doménì "%s"

source: while preparing output
cs: pøi pøípravì výstupu

source: %s and %s are mutually exclusive
cs: %s a %s se vzájemnì vyluèují

source: at least two files must be specified
cs: musí být zadány nejménì dva rùzné soubory

source: impossible selection criteria specified (%d < n < %d)
cs: zadáno nemo¾né výbìrové kritérium (%d < n < %d)

source: Usage: %s [OPTION] INPUTFILE ... Mandatory arguments to long options are mandatory for short options too. -d, --default-domain=NAME use NAME.po for output (instead of messages.po) -D, --directory=DIRECTORY add DIRECTORY to list for input files search -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars -f, --files-from=FILE get list of input files from FILE --force-po write PO file even if empty -F, --sort-by-file sort output by file location -h, --help display this help and exit
cs: Pou¾ití: %s [PØEPÍNAÈ] VSTUPNÍSOUBOR ... Argumenty povinné pro dlouhé pøepínaèe, jsou té¾ povinné pro jejich krátké formy. -d, --default-domain=JMÉNO zapí¹e výstup do JMÉNO.po (místo do messages.po) -D, --directory=ADRESÁØ pøidá ADRESÁØ do seznamu adresáøù pro hledání vstupních souborù -e, --no-escape nepou¾ívá escape sekvence z C ve výstupu (implicitní) -E, --escape pou¾ívá C escape sekvence ve výstupu, bez roz¹íøených znakù -f, --files-from=SOUBOR vezme seznam vstupních souborù ze SOUBORu --force-po vypí¹e .po soubor, i kdy¾ je prázdný -F, --sort-by-file seøadí výstup podle umístìní zpráv ve zdrojových souborech -h, --help vypí¹e tuto nápovìdu a ukonèí se

source: -i, --indent write the .po file using indented style --no-location do not write '#: filename:line' lines -n, --add-location generate '#: filename:line' lines (default) --omit-header don't write header with `msgid ""' entry -o, --output=FILE write output to specified file -p, --output-dir=DIR output files will be placed in directory DIR -s, --sort-output generate sorted output and remove duplicates --strict write out strict Uniforum conforming .po file -T, --trigraphs understand ANSI C trigraphs for input -u, --unique shorthand for --less-than=2, requests that only unique messages be printed
cs: -i, --indent vypí¹e .po soubor odsazovacím stylem --no-location nevytváøí øádky '#: filename:line' -n, --add-location vytváøí øádky '#: jméno_souboru:øádka' øádky (implicitní) --omit-header nevypisuje hlavièku s `msgid ""' polo¾kou -o, --output=SOUBOR zapí¹e výstup do urèeného souboru -p, --output-dir=ADRESÁØ výstupní soubory budou umístìny do tohoto adresáøe -s, --sort-output generuje seøazený výstup bez duplicitních zpráv --strict vytvoøí výstupní soubor ve stylu Uniforum -T, --trigraphs rozumí ANSI C `trigraphs' na vstupu -u, --unique zkratka pro --less-than=2, výstupem budou pouze zprávy obsa¾ené v katalogích pouze jednou

source: -V, --version output version information and exit -w, --width=NUMBER set output page width -<, --less-than=NUMBER print messages with less than this many definitions, defaults to infinite if not set ->, --more-than=NUMBER print messages with more than this many definitions, defaults to 1 if not set Find messages which are common to two or more of the specified PO files. By using the --more-than option, greater commonality may be requested before messages are printed. Conversely, the --less-than option may be used to specify less commonality before messages are printed (i.e. --less-than=2 will only print the unique messages). Translations, comments and extract comments will be preserved, but only from the first PO file to define them. File positions from all PO files will be preserved.
cs: -V, --version vypí¹e oznaèení verze a ukonèí se -w, --width=ÈÍSLO nastaví výstupní ¹íøku stránky -<, --less-than=ÈÍSLO vypí¹e pouze zprávy, které se vyskytují ménì ne¾ ÈÍSLO krát, implicitnì nastaveno nekoneèno ->, --more-than=ÈÍSLO vypí¹e pouze zprávy, které se vyskytují více ne¾ ÈÍSLO krát, implicitnì nastaveno na 1 Nalezne zprávy, které jsou spoleèné pro dva nebo více zadaných .po souborù. Pou¾itím pøepínaèe --more-than, lze dosáhnout zvìt¹ení indexu spoleènosti. Naopak pøepínaè --less-than mù¾e být pou¾it pro zmen¹ení indexu spoleènosti (--less-then=2 zpùsobí výpis pouze jedineèných, co do poèetnosti, zpráv. Pøeklady, komentáøe a vyta¾ené komentáøe budou ponechány, ale pouze z prvního .po souboru, který je definuje. Oznaèení pozic v souborech bude ponecháno ze v¹ech .po souborù.

source: error while opening "%s" for reading
cs: chyba pøi otevírání souboru "%s" pro ètení

source: this file may not contain domain directives
cs: tento soubor nemù¾e obsahovat pøíkazy pro doménu

source: no input file given
cs: vstupní soubor není zadán

source: error while opening "%s" for writing
cs: chyba pøi otevírání souboru "%s" pro zápis

source: Usage: %s [OPTION] filename.po ... Generate binary message catalog from textual translation description. Mandatory arguments to long options are mandatory for short options too. -a, --alignment=NUMBER align strings to NUMBER bytes (default: %d) -c, --check perform language dependent checks on strings -D, --directory=DIRECTORY add DIRECTORY to list for input files search -f, --use-fuzzy use fuzzy entries in output -h, --help display this help and exit --no-hash binary file will not include the hash table -o, --output-file=FILE specify output file name as FILE --statistics print statistics about translations --strict enable strict Uniforum mode -v, --verbose list input file anomalies -V, --version output version information and exit Giving the -v option more than once increases the verbosity level. If input file is -, standard input is read. If output file is -, output is written to standard output.
cs: Pou¾ití: %s [PØEPÍNAÈ] soubor.po ... Argumenty povinné pro dlouhé pøepínaèe, jsou té¾ povinné pro odpovídající krátké formy. -a, --alignment=ÈÍSLO zarovná øetìzce do ÈÍSLO bajtù (implicitnì: %d) -c, --check vykoná jazykovì závislé kontroly øetìzcù -D, --directory=ADRESÁØ pøidá ADRESÁØ do seznamu adresáøù pro hledání vstupních souborù -f, --use-fuzzy ve výstupu pou¾ije i fuzzy polo¾ky -h, --help vypí¹e tuto nápovìdu a ukonèí se --no-hash binární soubor nebude obsahovat ha¹ovací tabulku -o, --output-file=SOUBOR zapí¹e výstup do souboru SOUBOR --statistics vypí¹e statistiky o pøekladech --strict zpùsobí pøísné dodr¾ování stylu Uniforum -v, --verbose vypí¹e seznam neobvyklostí ve vstupním souboru -V, --version vypí¹e oznaèení verze a ukonèí se Zadáním pøepínaèe -v více ne¾ jednou, zvý¹íte podrobnost výpisù. Bude-li vstupní soubor -, bude èten standardní vstup. Jestli¾e výstupní soubor bude -, výstup bude vypisován do standardního výstupu.

source: while creating hash table
cs: pøi tvorbì ha¹ovací tabulky

source: domain name "%s" not suitable as file name
cs: jméno domény "%s" není vhodné jako jméno souboru

source: domain name "%s" not suitable as file name: will use prefix
cs: jméno domény "%s" není vhodné jako jméno souboru: bude pou¾ito jako pøedpona

source: `domain %s' directive ignored
cs: pøíkaz `domain %s' ignorován

source: empty `msgstr' entry ignored
cs: prázdná polo¾ka `msgstr' ignorována

source: fuzzy `msgstr' entry ignored
cs: fuzzy polo¾ka `msgstr' ignorována

source: headerfield `%s' missing in header
cs: polo¾ka hlavièky `%s' v hlavièce chybí

source: header field `%s' should start at beginning of line
cs: polo¾ka hlavièky `%s' by mìla zaèínat na zaèátku øádku

source: some header fields still have the initial default value
cs: nìkteré polo¾ky hlavièky mají stále poèáteèní implicitní hodnotu

source: field `%s' still has initial default value
cs: polo¾ka `%s' má stále poèáteèní implicitní hodnotu

source: %s: warning: source file contains fuzzy translation
cs: %s: varování: zdrojový soubor obsahuje fuzzy pøeklad

source: `msgid' and `msgstr' entries do not both begin with '\n'
cs: obì polo¾ky `msgid' a `msgstr' nezaèínají '\n'

source: `msgid' and `msgstr' entries do not both end with '\n'
cs: obì polo¾ky `msgid' a `msgstr' nekonèí '\n'

source: number of format specifications in `msgid' and `msgstr' does not match
cs: poèet formátovacích specifikátorù v `msgid' a `msgstr' není stejný

source: Merges two Uniforum style .po files together. The def.po file is an existing PO file with the old translations which will be taken over to the newly created file as long as they still match; comments will be preserved, but extract comments and file positions will be discarded. The ref.po file is the last created PO file (generally by xgettext), any translations or comments in the file will be discarded, however dot comments and file positions will be preserved. Where an exact match cannot be found, fuzzy matching is used to produce better results. The results are written to stdout unless an output file is specified.
cs: Slije dva .po soubory stylu Uniforum dohromady. Soubor def.po je existující .po soubor se starými pøeklady, které budou pøevzaty do novì vytvoøeného souboru, tak jak jsou, ale k odpovídajícím vzorùm. Komentáøe budou zachovány, ale vyjmuté komentáøe a pozice v souborech budou zahozeny. Soubor ref.po je poslední vytvoøený PO soubor (obvykle programem xgettext). V¹echny pøeklady nebo komentáøe z tohoto souboru budou zahozeny, av¹ak vyjmuté komentáøe a pozice v souborech budou zachovány. Pøeklady, které se nepodaøí pøiøadit na základì pøesné shody vzorù, budou pøiøazeny na základì podobnosti vzorù. Tím je dosa¾eno lep¹ího slití obou katalogù. Není-li výstupní soubor urèen, výsledek bude zapisován do stdout.

source: done.
cs: dokonèeno.

source: Usage: %s [OPTION] [FILE]... Mandatory arguments to long options are mandatory for short options too. -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -h, --help display this help and exit -i, --indent write indented output style -o, --output-file=FILE write output into FILE instead of standard output --strict write strict uniforum style -V, --version output version information and exit -w, --width=NUMBER set output page width
cs: Pou¾ití: %s [PØEPÍNAÈ] [SOUBOR]... Argumenty povinné pro dlouhé pøepínaèe, jsou té¾ povinné pro jejich krátké formy. -e, --no-escape nepou¾ívá C escape sekvence ve výstupu (implicitní) -E, --escape pou¾ívá C escape sekvence ve výstupu, bez roz¹íøených znakù --force-po zapí¹e .po soubor, i kdy¾ je prázdný -h, --help vypí¹e tuto nápovìdu a ukonèí se -i, --indent odsazený výstupní styl -o, --output-file=SOUBOR výsledek bude zapsán do SOUBORu --strict zpùsobí pøísné dodr¾ování stylu Uniforum -V, --version vypí¹e oznaèení verze a ukonèí se -w, --width=ÈÍSLO nastaví ¹íøku výstupní stránky

source: Convert binary .mo files to Uniforum style .po files. Both little-endian and big-endian .mo files are handled. If no input file is given or it is -, standard input is read. By default the output is written to standard output.
cs: Pøevádí binární .mo soubory do .po souborù stylu Uniforum. Oba typy .mo souborù little-endian a big-endian jsou akceptovány. Nebude-li vstupní soubor zadán, nebo bude-li -, bude èten standardní vstup. Implicitnì je výstup zapisován do standardního výstupu.

source: error while reading "%s"
cs: chyba pøi ètení "%s"

source: file "%s" truncated
cs: soubor "%s" je useknutý

source: seek "%s" offset %ld failed
cs: posun v souboru "%s" na pozici %ld selhal

source: file "%s" is not in GNU .mo format
cs: soubor "%s" není v GNU formátu .mo

source: missing `msgstr' section
cs: chybí sekce `msgstr'

source: too many errors, aborting
cs: pøíli¹ mnoho chyb, konèím

source: keyword "%s" unknown
cs: klíèové slovo "%s" není známo

source: end-of-file within string
cs: konec souboru uprostøed øetìzce

source: end-of-line within string
cs: konec øádku uprostøed øetìzce

source: internationalized messages should not contain the `\%c' escape sequence
cs: zprávy katalogu nesmí obsahovat escape sekvenci `\%c'

source: cannot create output file "%s"
cs: výstupní soubor "%s" nelze vytvoøit

source: standard output
cs: standardní výstup

source: error while writing "%s" file
cs: chyba pøi zápisu do souboru "%s"

source: standard input
cs: standardní vstup

source: %s:%d: warning: unterminated character constant
cs: %s:%d: varování: neukonèená znaková konstanta

source: %s:%d: warning: unterminated string literal
cs: %s:%d: varování: neukonèený øetìzec literálù

source: --join-existing cannot be used when output is written to stdout
cs: --join-existing nemù¾e být pou¾it, je-li výstup zapisován do stdout

source: warning: file `%s' extension `%s' is unknown; will try C
cs: varování: pøípona `%2$s' souboru `%1$s' není známa; zkusím C

source: Usage: %s [OPTION] INPUTFILE ... Extract translatable string from given input files. Mandatory arguments to long options are mandatory for short options too. -a, --extract-all extract all strings -c, --add-comments[=TAG] place comment block with TAG (or those preceding keyword lines) in output file -C, --c++ shorthand for --language=C++ --debug more detailed formatstring recognision result -d, --default-domain=NAME use NAME.po for output (instead of messages.po) -D, --directory=DIRECTORY add DIRECTORY to list for input files search -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars -f, --files-from=FILE get list of input files from FILE --force-po write PO file even if empty --foreign-user omit FSF copyright in output for foreign user -F, --sort-by-file sort output by file location
cs: Pou¾ití: %s [PØEPÍNAÈ] VSTUPNÍSOUBOR ... Argumenty povinné pro dlouhé pøepínaèe, jsou té¾ povinné pro jejich krátké formy. -a, --extract-all extrahuje v¹echny øetìzce -c, --add-comments[=JMENOVKA] umístí blok komentáøe se JMENOVKOU (nebo ty, které pøedcházejí øádku s klíèovým slovem) do výstupního souboru -C, --c++ zkratka pro --language=C++ --debug detailnìj¹í informace o rozpoznávání formátovacích øetìzcù -d, --default-domain=JMÉNO pou¾ije JMÉNO.po pro výstup (místo messages.po) -D, --directory=ADRESÁØ pøidá ADRESÁØ do seznamu adresáøù, ve kterých se hledají vstupní soubory -e, --no-escape nepou¾ívá C escape sekvence ve výstupu (implicitní) -E, --escape pou¾ívá C escape sekvence ve výstupu, bez roz¹íøených znakù -f, --files-from=SOUBOR seznam vstupních souborù bude èten ze SOUBORu --force-po zapí¹e .po soubor, i kdy¾ bude prázdný --foreign-user vynechá copyright FSF ve výstupu -F, --sort-by-file seøadí výstup podle umístìní zpráv ve zdrojových souborech

source: -n, --add-location generate '#: filename:line' lines (default) --omit-header don't write header with `msgid ""' entry -o, --output=FILE write output to specified file -p, --output-dir=DIR output files will be placed in directory DIR -s, --sort-output generate sorted output and remove duplicates --strict write out strict Uniforum conforming .po file -T, --trigraphs understand ANSI C trigraphs for input -V, --version output version information and exit -w, --width=NUMBER set output page width -x, --exclude-file=FILE entries from FILE are not extracted If INPUTFILE is -, standard input is read.
cs: -n, --add-location vytváøí øádky '#: jméno_souboru:øádek' (impl.) --omit-header nezapisuje hlavièku s `msgid ""' polo¾kou -o, --output=SOUBOR zapí¹e výstup do urèeného souboru -p, --output-dir=ADRESÁØ výstupní soubory budou umístìny do adresáøe ADRESÁØ -s, --sort-output generuje seøazený výstup bez duplicitních zpráv --strict výstupní soubor bude stylu Uniforum -T, --trigraphs zapne podporu ANSI C `trigraphs' na vstupu -V, --version vypí¹e oznaèení verze a ukonèí se -w, --width=ÈÍSLO nastaví výstupní ¹íøku stránky -x, --exclude-file=SOUBOR soubory ze SOUBORu nebudou zpracovány Bude-li VSTUPNÍSOUBOR -, bude èten standardní vstup.

source: language `%s' unknown
cs: jazyk `%s' není znám
