Repository: autotools-mirror/gettext
Catalog: gettext-runtime/po/*.po
Languages: hr, pt, pt_br, sk

source: The escape sequences are: %s backslash %s alert (BEL) %s backspace (BS) %s form feed (FF) %s new line (LF) %s carriage return (CR) %s horizontal tab (HT) %s vertical tab (VT) %s octal number with 1 to 3 octal digits
hr: Maskirani (escape) nizovi su: %s backslash, obrnuta kosa crta %s alert (BEL), upozorenje %s backspace (BS), briše znak ispred %s form feed (FF) %s new line (LF), znak novog retka %s carriage return (CR) %s horizontal tab (HT), horizontalni tabulator %s vertical tab (VT), vertikalni tabulator %s oktalni broj s 1 do 3 oktalne znamenke
pt: As sequências de escape são: %s barra esquerda %s alerta (BEL) %s recuo (BS) %s form feed (FF) %s nova linha (LF) %s retorno do carro (CR) %s tabulação horizontal (HT) %s tabulação vertical (VT) %s número octal com 1 a 3 algarismos octais
pt_br: As sequências de escape são: %s barra invertida %s alerta (BEL) %s backspace (BS) %s form feed (FF) %s nova linha (LF) %s retorno de carro (CR) %s tabulação horizontal (HT) %s tabulação vertical (VT) %s número octal com 1 a 3 dígitos octal

source: Environment variables:
hr: Varijable okruženja:
pt: Variáveis de ambiente:
pt_br: Variáveis de ambiente:

source: The translation of the format string is looked up in the translation domain given by the environment variable %s.
hr: Prijevod stringa formata tražit će se u domeni prijevodaodređenoj varijablom okruženja %s.
pt: A tradução da cadeia de formato é procurada no domínio da tradução dado pela variável e ambiente %s.
pt_br: A tradução da string de formato é procurada no domínio de tradução fornecido pela variável de ambiente %s.

source: It is looked up in the catalogs directory given by the environment variable %s or, if not present, in the default catalogs directory. This binary is configured to use the default catalogs directory: %s
hr: Traži se u direktoriju kataloga koji je određen varijablom okruženja %s ili, a ako ga nema, onda u zadanom direktoriju kataloga. Ova binarna datoteka konfigurirana je da koristi zadani direktorij kataloga: %s
pt: É procurada na pasta de catálogos dada pela variável de ambiente %s ou, se ausente, na pasta de catálogos pré-definida. Este binário está configurado para usar a pasta de catálogos pré-definida: %s
pt_br: É pesquisado no diretório de catálogos fornecido pela variável de ambiente %s ou, se não estiver presente, no diretório de catálogos padrão. Este binário está configurado para usar o diretório de catálogos padrão: %s.

source: Usage: %s [OPTION] FORMAT FORMAT-PLURAL COUNT [ARGUMENT]...
hr: Uporaba: %s [OPCIJA] FORMAT FORMAT-PLURALA KOLIČINA [ARGUMENT]...
pt: Uso: %s [OPÇÃO] FORMATO FORMATO-PLURAL CONT [ARGUMENTO]...
pt_br: Uso: %s [OPÇÃO] FORMATO FORMATO-PLURAL CONTAGEM [ARGUMENTO]...

source: Produces formatted output, applying the native language translation of FORMAT and FORMAT-PLURAL, depending on COUNT, to the ARGUMENTs.
hr: Generira formirani izlaz podataka primijenom prijevoda FORMATA i FORMAT-PLURALA, ovisno o KOLIČINI, na ARGUMENTE.
pt: Produz saída formatada, apllicando a tradução em idioma nativo de FORMATO e FORMATO-PLURAL, dependendo de CONT, para os ARGUMENTOs.
pt_br: Produz um saída formatada,a plicando a tradução do idioma nativo de FORMATO e FORMAT-PLURAL, dependendo de CONTAGEM, para os ARGUMENTOs.

source: FORMAT English singular form of format string
hr: FORMAT Singular stringa za format na engleskom
pt: FORMATO Forma singular inglesa da cadeia de formato
pt_br: FORMATO Forma singular em inglês da string de formato

source: FORMAT-PLURAL English plural form of format string
hr: FORMAT-PLURAL Plural stringa za format na engleskom
pt: FORMATO-PLURAL Forma plural inglesa da cadeia de formato
pt_br: FORMATO-PLURAL Forma de plural em inglês da string de formato

source: Each format string consists of - plain text, - directives, that start with '%c', - escape sequences, that start with a backslash.
hr: Svaki format string sastoji se od - obični tekst, - direktiva, koja počinjue s ‘%c’, - maskirani (escape) nizovi, koji započinju s obrnutom kosom crtom, backslash.
pt: Cada cadeia de formato consiste em - texto simples, - directivas, que começam com "%c", - sequências de escape, que começam com "\".
pt_br: Cada string de formato consiste em - texto simples, - diretivas, que começam com "%c", - sequências de escape, que começam com uma barra invertida.
