Repository: autotools-mirror/gettext
Catalog: gettext-runtime/po/*.po
Languages: hr, pt, pt_br, sk

source: invalid argument `%s' for `%s'
sk: neplatný parameter "%s" pre "%s"

source: ambiguous argument `%s' for `%s'
sk: nejednoznaèný parameter "%s" pre "%s"

source: Valid arguments are:
sk: Platné parametre sú:

source: error while opening "%s" for reading
sk: chyba pri otváraní súboru "%s" na èítanie

source: cannot open backup file "%s" for writing
sk: nemô¾em otvori» súbor "%s" na zápis

source: error reading "%s"
sk: chyba pri èítaní "%s"

source: error writing "%s"
sk: chyba pri zápise "%s"

source: error after reading "%s"
sk: chyba po èítaní "%s"

source: Unknown system error
sk: Neznáma systémová chyba

source: %s subprocess failed
sk: %s podproces zlyhal

source: %s: option `%s' is ambiguous
sk: %s: voµba `%s' nie je jednoznaèná

source: %s: option `--%s' doesn't allow an argument
sk: %s: voµba `--%s' nepovoµuje parameter

source: %s: option `%c%s' doesn't allow an argument
sk: %s: voµba `%c%s' nepovoµuje parameter

source: %s: option `%s' requires an argument
sk: %s: voµba `%s' vy¾aduje parameter

source: %s: unrecognized option `--%s'
sk: %s: neznáma voµba `--%s'

source: %s: unrecognized option `%c%s'
sk: %s: neznáma voµba `%c%s'

source: %s: illegal option -- %c
sk: %s: neprípustná voµba -- %c

source: %s: invalid option -- %c
sk: %s: neplatná voµba -- %c

source: %s: option requires an argument -- %c
sk: %s: voµba vy¾aduje parameter -- %c

source: %s: option `-W %s' is ambiguous
sk: %s: voµba `-W %s' nie je jednoznaèná

source: %s: option `-W %s' doesn't allow an argument
sk: %s: voµba `-W %s' nedovoµuje pou¾itie parametra

source: Java compiler not found, try installing gcj or set $JAVAC
sk: Kompilátor Javy nebol nájdený. Skúste nain¹talova» gcj alebo nastavte $JAVAC

source: Java virtual machine not found, try installing gij or set $JAVA
sk: Virtuálny stroj Javy nebol nájdený. Skúste nain¹talova» gij alebo nastavte $JAVA

source: memory exhausted
sk: pamä» je vyèerpaná

source: cannot create pipe
sk: nemô¾em vytvori» rúru

source: %s subprocess
sk: %s podproces

source: %s subprocess got fatal signal %d
sk: %s podproces dostal kritický signál %d

source: number of format specifications in 'msgid' and '%s' does not match
sk: poèet formátovacích znaèiek v 'msgid' a '%s' sa nezhoduje

source: format specifications in 'msgid' and '%s' for argument %u are not the same
sk: formátovacie znaèky v 'msgid' a '%s' pre parameter %u nie sú rovnaké

source: a format specification for argument %u, as in '%s', doesn't exist in 'msgid'
sk: formátovacia znaèka pre parameter %u v '%s' nie je v 'msgid'

source: a format specification for argument %u doesn't exist in '%s'
sk: formátovacia znaèka pre parameter %u nie je v '%s'

source: a format specification for argument {%u}, as in '%s', doesn't exist in 'msgid'
sk: formátovacia znaèka pre parameter {%u} v '%s' nie je v 'msgid'

source: a format specification for argument {%u} doesn't exist in '%s'
sk: formátovacia znaèka pre parameter {%u} neexistuje v '%s'

source: format specifications in 'msgid' and '%s' for argument {%u} are not the same
sk: formátovacie znaèky v 'msgid' a '%s' pre parameter {%u} nie sú rovnaké

source: format specifications in 'msgid' and '%s' are not equivalent
sk: formátovacie znaèky v 'msgid' a '%s' nie sú ekvivalentné

source: format specifications in '%s' are not a subset of those in 'msgid'
sk: formátovacie znaèky v '%s' nie sú podmno¾inou znaèiek z 'msgid'

source: format specifications in 'msgid' expect a mapping, those in '%s' expect a tuple
sk: formátovacie znaèky v 'msgid' predpokladajú mapovanie, ale znaèky v '%s' predpokladajú tuple

source: format specifications in 'msgid' expect a tuple, those in '%s' expect a mapping
sk: formátovacie znaèky v 'msgid' predpokladajú tuple, ale znaèky v '%s' predpokladajú mapovanie

source: a format specification for argument '%s', as in '%s', doesn't exist in 'msgid'
sk: formátovacia znaèka pre parameter '%s' v '%s' nie je v 'msgid'

source: a format specification for argument '%s' doesn't exist in '%s'
sk: formátovacia znaèka pre parameter '%s' nie je v '%s'

source: format specifications in 'msgid' and '%s' for argument '%s' are not the same
sk: formátovacie znaèky v 'msgid' a '%s' pre parameter '%s' nie sú rovnaké

source: Copyright (C) %s Free Software Foundation, Inc. This is free software; see the source for copying conditions. There is NO warranty; not even for MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
sk: Autorské práva (C) %s Free Software Foundation, Inc. Toto je voµne ¹íriteµný softvér; pre podmienky kopírovania pozri zdrojový kód. Neposkytuje sa ®IADNA záruka; ani èo sa týka OBCHODOVATE¥NOSTI alebo VHODNOSTI NA KONKRÉTNY ÚÈEL.

source: Written by %s.
hr: Napisao %s.
pt: Escrito por %s.
pt_br: Escrito por %s.
sk: Napísal %s.

source: too many arguments
hr: previše argumenata
pt: demasiados argumentos
pt_br: número excessivo de argumentos
sk: príli¹ veµa parametrov

source: missing arguments
hr: nema argumenata
pt: argumentos em falta
pt_br: faltando argumentos
sk: chýbajúce parametre

source: Try `%s --help' for more information.
sk: Skúste `%s --help' a dozviete sa viac informácií.

source: Usage: %s [OPTION] [[TEXTDOMAIN] MSGID] or: %s [OPTION] -s [MSGID]...
hr: Uporaba: %s [OPCIJA] [[TEKSTDOMENA] MSGID] ili: %s [OPCIJA] -s [MSGID]...
pt: Uso: %s [OPÇÃO] [[DIALECTO] MSGID] ou: %s [OPÇÃO] -s [MSGID]...
pt_br: Uso: %s [OPÇÃO] [[DOMÍNIOTEXTO] MSGID] ou: %s [OPÇÃO] -s [MSGID]...
sk: Pou¾itie: %s [VO¥BA] [[DOMÉNA] ID_SPRÁVY] alebo: %s [VO¥BA] -s [ID_SPRÁVY]...

source: Display native language translation of a textual message.
hr: Ispiše prijevod tekstne poruke.
pt: Mostrar tradução de idioma nativo de uma mensagem textual.
pt_br: Exibe tradução do idioma nativo de uma mensagem textual.
sk: Zobrazi» preklad textovej správy do natívneho jazyka.

source: -d, --domain=TEXTDOMAIN retrieve translated messages from TEXTDOMAIN -e enable expansion of some escape sequences -E (ignored for compatibility) -h, --help display this help and exit -n suppress trailing newline -V, --version display version information and exit [TEXTDOMAIN] MSGID retrieve translated message corresponding to MSGID from TEXTDOMAIN
sk: -d, --domain=DOMÉNA vybra» prelo¾ené správy z DOMÉNY -e povoli» rozvinutie niektorých riadiacich sekvencií znakov -E (bez významu; kvôli spätnej kompatibilite) -h, --help zobrazi» túto nápovedu a skonèi» -n potlaèi» prázdnz riadok na konci -V, --version zobrazi» informáciu o verzii a skonèi» [DOMÉNA] ID_SPRÁVY vybra» prelo¾enú správu zodpovedajúcu ID_SPRÁVY z DOMÉNY

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. When used with the -s option the program behaves like the `echo' command. But it does not simply copy its arguments to stdout. Instead those messages found in the selected catalog are translated. Standard search directory: %s
sk: Ak nie je zadaný parameter DOMÉNA, doména bude prevzatá z premennej prostredia TEXTDOMAIN. Ak sa katalóg správ nenachádza v obvyklom adresári, iný adresár mô¾e by» urèený obsahom premennej prostredia TEXTDOMAINDIR. Ak je program pou¾itý s voµbou -s, bude sa správa» ak príkaz `echo'. Nevypí¹e v¹ak svoje parametre na ¹tandardný výstup. Namiesto toho správy, ktoré sa nachádzajú vo vybranom katalógu správ budú prelo¾ené. ©tandardný adresár, v ktorom sa budú hµada» katalógy: %s

source: Report bugs to <bug-gnu-gettext@gnu.org>.
sk: Správy o chybách zasielajte na adresu <bug-gnu-gettext@gnu.org> (iba anglicky). Komentáre k slovenskému prekladu zasielajte na adresu <sk-i18n@lists.linux.sk>.

source: Usage: %s [OPTION]
sk: Pou¾itie: %s [VO¥BA]

source: Print the machine's hostname.
sk: Zobrazi» hostiteµské meno stroja.

source: Output format: -s, --short short host name -f, --fqdn, --long long host name, includes fully qualified domain name, and aliases -i, --ip-address addresses for the hostname
sk: Výstupný formát: -s, --short krátke meno hostiteµa -f, --fqdn, --long dlhé meno hostiteµa, vrátane plne kvalifikovaného doménového mena a prezývok -i, --ip-address adresy pre meno hostiteµa

source: Informative output: -h, --help display this help and exit -V, --version output version information and exit
sk: Informatívny výstup: -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informáciu o verzii a skonèi»

source: could not get host name
sk: Nemô¾em získa» meno hostiteµa

source: at most one input file allowed
sk: povolený najviac jeden vstupný súbor

source: %s and %s are mutually exclusive
sk: %s a %s sa navzájom vyluèujú

source: Usage: %s [OPTION] [INPUTFILE]
sk: Pou¾itie: %s [VO¥BA] [VSTUPNÝSÚBOR]

source: Filters the messages of a translation catalog according to their attributes, and manipulates the attributes.
sk: Filtruje správy z prekladového katalógu podµa ich vlastností a mení tieto vlastnosti.

source: Mandatory arguments to long options are mandatory for short options too.
sk: Povinné parametre pre dlhé voµby sú povinnými aj pre skrátené voµby.

source: Input file location: INPUTFILE input PO file -D, --directory=DIRECTORY add DIRECTORY to list for input files search If no input file is given or if it is -, standard input is read.
sk: Umiestnenie vstupného súboru: VSTUPNÝSÚBOR vstupný PO súbor -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávané vstupné súbory Ak nie je zadaný vstupný súbor alebo je -, naèítaný je ¹tandardný vstup.

source: Output file location: -o, --output-file=FILE write output to specified file The results are written to standard output if no output file is specified or if it is -.
sk: Umiestnenie výstupného súboru: -o, --output-file=SÚBOR výstup zapísa» do zadaného súboru Ak nie je zadaný výstupný súbor alebo je -, výsledky su zapísané na ¹tandardný výstup.

source: Message selection: --translated keep translated, remove untranslated messages --untranslated keep untranslated, remove translated messages --no-fuzzy remove 'fuzzy' marked messages --only-fuzzy keep 'fuzzy' marked messages --no-obsolete remove obsolete #~ messages --only-obsolete keep obsolete #~ messages
sk: Výber správy: --translated zachova» prelo¾ené, odstráni» neprelo¾ené správy --untranslated zachova» neprelo¾ené, odstráni» prelo¾ené správy --no-fuzzy odstráni» nepresné preklady --only-fuzzy zachova» nepresné preklady --no-obsolete odstráni» zastarané správy oznaèené #~ --only-obsolete zachova» zastarané správy oznaèené #~

source: Attribute manipulation: --set-fuzzy set all messages 'fuzzy' --clear-fuzzy set all messages non-'fuzzy' --set-obsolete set all messages obsolete --clear-obsolete set all messages non-obsolete --fuzzy synonym for --only-fuzzy --clear-fuzzy --obsolete synonym for --only-obsolete --clear-obsolete
sk: Úprava vlastností: --set-fuzzy nastavi» v¹etky správy ako nepresné --clear-fuzzy nastavi» v¹etky správy ako nie nepresné --set-obsolete nastavi» v¹etky správy ako zastarané --clear-obsolete nastavi» v¹etky správy ako nie zastarané --fuzzy synonymum pre --only-fuzzy --clear-fuzzy --obsolete synonymum pre --only-obsolete --clear-obsolete

source: Output details: -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent write the .po file using indented style --no-location do not write '#: filename:line' lines -n, --add-location generate '#: filename:line' lines (default) --strict write out strict Uniforum conforming .po file -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location
sk: Podrobnosti výstupu: -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent zapísa» .po súbor s pou¾itím odsadzovania --no-location nezapisova» riadky '#: meno_súboru:riadok' -n, --add-location generova» riadky '#: meno_súboru:riadok' (predvolené) --strict zapísa» .po súbor presne dor¾iavajúci ¹týl Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch

source: impossible selection criteria specified (%d < n < %d)
sk: je uvedené nepovolené kritérium výberu (%d < n < %d)

source: Usage: %s [OPTION] [INPUTFILE]...
sk: Pou¾itie: %s [VO¥BA] [VSTUPNÝSÚBOR]...

source: Concatenates and merges the specified PO files. Find messages which are common to two or more of the specified PO files. By using the --more-than option, greater commonality may be requested before messages are printed. Conversely, the --less-than option may be used to specify less commonality before messages are printed (i.e. --less-than=2 will only print the unique messages). Translations, comments and extract comments will be cumulated, except that if --use-first is specified, they will be taken from the first PO file to define them. File positions from all PO files will be cumulated.
sk: Zlúèi zadané PO súbory. Nájde správy, ktoré sú spoloèné pre dva alebo viac zadaných PO súborov. S pou¾itím voµby --more-than mô¾e by» po¾adovaná väè¹ia zhodnos» pred výpisom správ. Naopak, voµba --less-than mô¾e by» pou¾itá na dosiahnutie men¹ej zhodnosti pred výpisom správ (t.j. pri zadaní --less-than=2, budú vypísané iba jedineèné správy). Preklady, komentáre a extrahované komentáre budú zlúèené; výnimkou je pou¾itie voµby --use-first, ktorá zabezpeèí ich zachovanie iba z prvého PO súboru, ktorý ich definuje. Pozície v zdrojových súboroch budú zlúèené zo v¹etkých PO súborov.

source: Input file location: INPUTFILE ... input files -f, --files-from=FILE get list of input files from FILE -D, --directory=DIRECTORY add DIRECTORY to list for input files search If input file is -, standard input is read.
sk: Umiestnenie vstupného súboru: VSTUPNÝSÚBOR ... vstupné súbory -f, --files-from=SÚBOR získa» zoznam vstupných súborov zo SÚBORu -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávané vstupné súbory Ak je vstupný súbor -, naèítaný je ¹tandardný vstup.

source: Output file location: -o, --output-file=FILE write output to specified file The results are written to standard output if no output file is specified or if it is -.
sk: Umiestnenie výstupného súboru: -o, --output-file=SÚBOR výstup zapísa» do zadaného súboru Ak nie je zadaný výstupný súbor alebo je -, výsledky su zapísané na ¹tandardný výstup.

source: Message selection: -<, --less-than=NUMBER print messages with less than this many definitions, defaults to infinite if not set ->, --more-than=NUMBER print messages with more than this many definitions, defaults to 0 if not set -u, --unique shorthand for --less-than=2, requests that only unique messages be printed
sk: Výber správy: -<, --less-than=POÈET vypísa» správy, ktoré sú definované menej ako POÈET-krát, ¹tandardne nastavené na nekoneèno ->, --more-than=POÈET vypísa» správy, ktoré sú defineované viac ako POÈET-krát, ¹tandardne nastavené na 0 -u, --unique skratka pre --less-than=2, nastavuje výpis len unikátnych správ

source: Output details: -t, --to-code=NAME encoding for output --use-first use first available translation for each message, don't merge several translations -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent write the .po file using indented style --no-location do not write '#: filename:line' lines -n, --add-location generate '#: filename:line' lines (default) --strict write out strict Uniforum conforming .po file -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location
sk: Podrobnosti výstupu: -t, --to-code=NÁZOV kódovanie pre výstup --use-first pou¾i» prvý dostupný preklad pre ka¾dú správu, nezluèova» viacero prekladov -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent zapísa» .po súbor s pou¾itím odsadzovania --no-location nezapisova» riadky '#: meno_súboru:riadok' -n, --add-location generova» riadky '#: meno_súboru:riadok' (predvolené) --strict zapísa» .po súbor presne dor¾iavajúci ¹týlu Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch

source: Informative output: -h, --help display this help and exit -V, --version output version information and exit
sk: Informatívny výstup: -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informáciu o verzii a skonèi»

source: no input files given
sk: neboli zadané vstupné súbory

source: exactly 2 input files required
sk: potrebné sú presne 2 vstupné súbory

source: Usage: %s [OPTION] def.po ref.pot
sk: Pou¾itie: %s [VO¥BA] def.po ref.pot

source: Compare two Uniforum style .po files to check that both contain the same set of msgid strings. The def.po file is an existing PO file with the translations. The ref.pot file is the last created PO file, or a PO Template file (generally created by xgettext). This is useful for checking that you have translated each and every message in your program. Where an exact match cannot be found, fuzzy matching is used to produce better diagnostics.
sk: Porovná dva .po súbory v ¹týle Uniforum a skontroluje, èi obsahujú zhodnú skupinu re»azcov msgid. Súbor def.po je existujúci PO súbor s prekladmi. Súbor ref.po je najnov¹í PO súbor alebo ¹ablóna PO (väè¹inou vytvorený programom xgettext). Pou¾íva sa na kontrolu, èi u¾ sú prelo¾ené v¹etky správy z programu. Keï nie je mo¾né nájs» presnú zhodu, je pou¾itý fuzzy algoritmus, ktorý umo¾òuje lep¹iu kontrolu zhody.

source: Input file location: def.po translations ref.pot references to the sources -D, --directory=DIRECTORY add DIRECTORY to list for input files search
sk: Umiestnenie vstupného súboru: def.po preklady ref.pot odkazy na zdrojové súbory -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávané vstupné súbory

source: Operation modifiers: -m, --multi-domain apply ref.pot to each of the domains in def.po
sk: Modifikátory operácie: -m, --multi-domain opu¾ije ref.pot na v¹etky domény v def.po

source: this message is used but not defined...
sk: táto správa je pou¾itá, ale nie je definovaná...

source: ...but this definition is similar
sk: ...ale táto definícia je podobná

source: this message is used but not defined in %s
sk: táto správa je pou¾itá, ale nie je definovaná v %s

source: warning: this message is not used
sk: upozornenie: táto správa nie je pou¾itá

source: found %d fatal error
sk: nájdených %d záva¾ných chýb

source: at least two files must be specified
sk: musia by» uvedené minimálne dva súbory

source: Find messages which are common to two or more of the specified PO files. By using the --more-than option, greater commonality may be requested before messages are printed. Conversely, the --less-than option may be used to specify less commonality before messages are printed (i.e. --less-than=2 will only print the unique messages). Translations, comments and extract comments will be preserved, but only from the first PO file to define them. File positions from all PO files will be cumulated.
sk: Nájde správy, ktoré sú spoloèné pre dva alebo viac zadaných PO súborov. S pou¾itím voµby --more-than mô¾e by» po¾adovaná väè¹ia zhodnos» pred výpisom správ. Naopak, voµba --less-than mô¾e by» pou¾itá na dosiahnutie men¹ej zhodnosti pred výpisom správ (t.j. pri zadaní --less-than=2, budú vypísané iba jedineèné správy). Preklady, komentáre a extrahované komentáre budú zachované iba z prvého PO súboru, v ktorom sú definované. Pozície v zdrojových súboroch budú zlúèené zo v¹etkých PO súborov.

source: Message selection: -<, --less-than=NUMBER print messages with less than this many definitions, defaults to infinite if not set ->, --more-than=NUMBER print messages with more than this many definitions, defaults to 1 if not set -u, --unique shorthand for --less-than=2, requests that only unique messages be printed
sk: Výber správy: -<, --less-than=POÈET vypísa» správy, ktoré sú definované menej ako POÈET-krát, ¹tandardne nastavené na nekoneèno ->, --more-than=POÈET vypísa» správy, ktoré sú defineované viac ako POÈET-krát, ¹tandardne nastavené na 1 -u, --unique skratka pre --less-than=2, nastavuje výpis len unikátnych správ

source: Output details: -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent write the .po file using indented style --no-location do not write '#: filename:line' lines -n, --add-location generate '#: filename:line' lines (default) --strict write out strict Uniforum conforming .po file -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location --omit-header don't write header with `msgid ""' entry
sk: Podrobnosti výstupu: -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent zapísa» .po súbor výstup s pou¾itím odsadzovania --no-location nezapisova» riadky '#: meno_súboru:riadok' -n, --add-location generova» riadky '#: meno_súboru:riadok' (predvolené) --strict zapísa» .po súbor presne dor¾iavajúci ¹týl Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch --omit-header nezapisova» hlavièku s polo¾kou `msgid ""'

source: Converts a translation catalog to a different character encoding.
sk: Konvertova» prekladový katalóg do iného kódovania znakov.

source: Conversion target: -t, --to-code=NAME encoding for output The default encoding is the current locale's encoding.
sk: Cieµ konverzie: -t, --to-code=NÁZOV kódovanie výstupu Predvolené kódovanie je kódovanie aktuálneho národného prostreda.
