Repository: autotools-mirror/gettext
Catalog: gettext-runtime/po/*.po
Languages: hr, pt, pt_br, sk

source: Output details: -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent indented output style --no-location suppress '#: filename:line' lines --add-location preserve '#: filename:line' lines (default) --strict strict Uniforum output style -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location
sk: Podrobnosti výstupu: -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent výstup s pou¾itím odsadzovania --no-location nezapisova» riadky '#: meno_súboru:riadok' --add-location zachova» riadky '#: meno_súboru:riadok' (predvolené) --strict presné dor¾iavanie ¹týlu Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch

source: no input file given
sk: nie sú zadané vstupné súbory

source: exactly one input file required
sk: potrebné je presne jeden vstupný súbor

source: Usage: %s [OPTION] INPUTFILE
sk: Pou¾itie: %s [VO¥BA] VSTUPNÝSÚBOR

source: Creates an English translation catalog. The input file is the last created English PO file, or a PO Template file (generally created by xgettext). Untranslated entries are assigned a translation that is identical to the msgid, and are marked fuzzy.
sk: Vytvorí anglický prekladový katalóg. Vstupný súbor je posledne vytvorený anglický PO súbor, alebo ¹ablóna PO (väè¹inou vytvorená programom xgettext). Neprelo¾eným polo¾kám je priradený preklad zhodný z msgid a sú oznaèené ako nepresné (fuzzy).

source: Input file location: INPUTFILE input PO or POT file -D, --directory=DIRECTORY add DIRECTORY to list for input files search If input file is -, standard input is read.
sk: Umiestnenie vstupného súboru: VSTUPNÝSÚBOR vstupný PO alebo POT súbor -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávané vstupné súbory Ak je vstupný súbor -, naèítaný je ¹tandardný vstup.

source: missing command name
sk: chýbajúci názov príkazu

source: Usage: %s [OPTION] COMMAND [COMMAND-OPTION]
sk: Pou¾itie: %s [VO¥BA] PRÍKAZ [VO¥BA-PRÍKAZU]

source: Applies a command to all translations of a translation catalog. The COMMAND can be any program that reads a translation from standard input. It is invoked once for each translation. Its output becomes msgexec's output. msgexec's return code is the maximum return code across all invocations.
sk: Aplikuje príkaz na v¹etky preklady z prekladového katalógu. PRÍKAZ mo¾e by» µubovoµný program, ktorý èíta preklad zo ¹tandardného vstupu. Príkaz je spustený pre ka¾dý preklad samostatne. Výstup príkazu bude aj výstupom programu msgexec. Návratová hodnota programu msgexec je maximum návratových hodnôt v¹etkých spustení príkazu.

source: A special builtin command called '0' outputs the translation, followed by a null byte. The output of "msgexec 0" is suitable as input for "xargs -0".
sk: ©peciálny vstavaný príkaz s názvom '0' vypisuje preklad nasledovaný nulovým bajtom. Výstup príkazu "msgexec 0" je pou¾iteµný ako vstup pre "xargs -0".

source: Input file location: -i, --input=INPUTFILE input PO file -D, --directory=DIRECTORY add DIRECTORY to list for input files search If no input file is given or if it is -, standard input is read.
sk: Umiestnenie vstupného súboru: -i, --input=VSTUPNÝSÚBOR vstupný PO súbor -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávanie vstupných súborov Ak nie je zadaný vstupný súbor alebo je -, je naèítaný ¹tandardný vstup.

source: write to stdout failed
sk: zápis na ¹tandardný výstup zlyhal

source: write to %s subprocess failed
sk: zápis do podprocesu %s zlyhal

source: missing filter name
sk: chýbajúci názov filtra

source: at least one sed script must be specified
sk: musí by» uvedený aspoò jeden sed skript

source: Usage: %s [OPTION] FILTER [FILTER-OPTION]
sk: Pou¾itie: %s [VO¥BA] FILTER [VO¥BA-FILTRA]

source: Applies a filter to all translations of a translation catalog.
sk: Aplikova» filter na v¹etky preklady prekladového katalógu.

source: The FILTER can be any program that reads a translation from standard input and writes a modified translation to standard output.
sk: FILTER mô¾e by» µubovoµný program, ktorý èíta preklady zo ¹tandardného vstupu a zapisuje upravené preklady na ¹tandardný výstup.

source: Useful FILTER-OPTIONs when the FILTER is 'sed': -e, --expression=SCRIPT add SCRIPT to the commands to be executed -f, --file=SCRIPTFILE add the contents of SCRIPTFILE to the commands to be executed -n, --quiet, --silent suppress automatic printing of pattern space
sk: U¾itoèné VO¥BY-FILTRA keï je pou¾itý FILTER 'sed': -e, --expression=SKRIPT prida» SKRIPT k vykonávaným príkazom -f, --file=SÚBORSKRIPTU prida» obsah súboru SÚBORSKRIPTU k výkonávaným príkazom -n, --quiet, --silent potlaèi» automatickú tlaè priestoru vzorov

source: Output details: --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty --indent indented output style --keep-header keep header entry unmodified, don't filter it --no-location suppress '#: filename:line' lines --add-location preserve '#: filename:line' lines (default) --strict strict Uniforum output style -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location
sk: Podrobnosti výstupu: --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny --indent výstup s pou¾itím odsadzovania --keep-header zachova» polo¾ku hlavièky nezmenenú, neodfiltrova» ju --no-location nezapisova» riadky '#: meno_súboru:riadok' --add-location zachova» riadky '#: meno_súboru:riadok' (predvolené) --strict presné dor¾iavanie ¹týlu Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch

source: cannot set up nonblocking I/O to %s subprocess
sk: nemô¾em nastavi» neblokujúce V/V na podproces %s

source: communication with %s subprocess failed
sk: komunikácia s podprocesom %s zlyhala

source: read from %s subprocess failed
sk: èítanie z podprocesu %s zlyhalo

source: %s subprocess terminated with exit code %d
sk: podproces %s bol ukonèený s ukonèovacím kódom %d

source: the argument to %s should be a single punctuation character
sk: parameter pre %s by malo by» len jedno interpunkèné znamienko

source: %s requires a "-d directory" specification
sk: %s vy¾aduje ¹pecifikáciu "-d adresár"

source: %s requires a "-l locale" specification
sk: %s vy¾aduje ¹pecifikáciu "-l národné prostredie"

source: %s is only valid with %s
sk: %s je platné len s %s

source: %s is only valid with %s or %s
sk: %s je platné len s %s alebo %s

source: %d translated message
sk: %d prelo¾ených správ

source: , %d fuzzy translation
sk: , %d nepresných prekladov

source: , %d untranslated message
sk: , %d neprelo¾ených správ

source: Usage: %s [OPTION] filename.po ...
sk: Pou¾itie: %s [VO¥BA] menosúboru.po ...

source: Generate binary message catalog from textual translation description.
sk: Generova» binárny katalóg správ z textového popisu prekladu.

source: Input file location: filename.po ... input files -D, --directory=DIRECTORY add DIRECTORY to list for input files search If input file is -, standard input is read.
sk: Umiestnenie vstupného súboru: menosúboru.po ... vstupné súbory -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávanie vstupných súborov Ak je vstupný súbor -, je naèítaný ¹tandardný vstup.

source: Operation mode: -j, --java Java mode: generate a Java ResourceBundle class --java2 like --java, and assume Java2 (JDK 1.2 or higher) --tcl Tcl mode: generate a tcl/msgcat .msg file
sk: Mód èinnosti: -j, --java mód Java: generova» triedu Java ResourceBundle --java2 ako --java ale predpoklada» Java2 (JDK 1.2 alebo vy¹¹ie) --tcl mód Tcl: generova» súbor .msg tcl/msgcat

source: Output file location: -o, --output-file=FILE write output to specified file --strict enable strict Uniforum mode If output file is -, output is written to standard output.
sk: Umiestnenie výstupného súboru: -o, --output-file=SÚBOR zapísa» výstup do zadaného súboru --strict povoli» presne dodr¾aný mód Uniforum Ak je výstupný súbor -, výstup je zapísaný na ¹tandardný výstup.

source: Output file location in Java mode: -r, --resource=RESOURCE resource name -l, --locale=LOCALE locale name, either language or language_COUNTRY -d DIRECTORY base directory of classes directory hierarchy The class name is determined by appending the locale name to the resource name, separated with an underscore. The -d option is mandatory. The class is written under the specified directory.
sk: Umiestnenie výstupného súboru v móde Java: -r, --resource=ZDROJ názov zdroja -l, --locale=N_PROSTREDIE názov národného prostredia, buï jazyk alebo jazyk_KRAJINA -d ADRESÁR základný adresár adresárov hierarchie tried Názov triedy je získaný pridaním názvu národného pristredia k názvu zdroja, oddelené znakom "_". Voµba -d je povinná. Trieda je zapísaná do zadaného adresára.

source: Output file location in Tcl mode: -l, --locale=LOCALE locale name, either language or language_COUNTRY -d DIRECTORY base directory of .msg message catalogs The -l and -d options are mandatory. The .msg file is written in the specified directory.
sk: Umiestnenie výstupného súboru v móde Tcl: -l, --locale=N_PROSTREDIE názov národného prostredia, buï jazyk alebo jazyk_KRAJINA -d ADRESÁR základný adresár katalógov správ .msg Voµby -l a -d sú povinné. Súbor .msg je zapísaný do zadaného adresára.

source: Input file interpretation: -c, --check perform all the checks implied by --check-format, --check-header, --check-domain --check-format check language dependent format strings --check-header verify presence and contents of the header entry --check-domain check for conflicts between domain directives and the --output-file option -C, --check-compatibility check that GNU msgfmt behaves like X/Open msgfmt --check-accelerators[=CHAR] check presence of keyboard accelerators for menu items -f, --use-fuzzy use fuzzy entries in output
sk: Interpretácia vstupného súboru: -c, --check vykona» v¹etky kontroly ako pri --check-format, --check-header, --check-domain --check-format kontrolova» jazykovo závislé formátované re»azce --check-header overi» prítomnos» a obsah polo¾ky hlavièky --check-domain kontrolova» konflikty medzi direktívami domény a voµbou --output-file -C, --check-compatibility kontrolova», èi sa GNU msgfmt správa tak ako X/Open msgfmt --check-accelerators[=ZNAK] kontrolova» prítomnos» klávesových skratiek pre polo¾ky menu -f, --use-fuzzy pou¾i» polo¾ky fuzzy vo výstupe

source: Output details: -a, --alignment=NUMBER align strings to NUMBER bytes (default: %d) --no-hash binary file will not include the hash table
sk: Podrobnosti výstupu: -a, --alignment=POÈET zarovna» re»azce na POÈET bajtov (¹tandardne: %d) --no-hash binárny súbor nebude obsahova» ha¹ovaciu tabuµku

source: Informative output: -h, --help display this help and exit -V, --version output version information and exit --statistics print statistics about translations -v, --verbose increase verbosity level
sk: Informatívny výstup: -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informáciu o verzii a skonèi» --statistics zobrazi» ¹tatistiky prekladov -v, --verbose zvý¹i» úroveò táravosti

source: plural expression can produce negative values
sk: výraz pre mno¾né èíslo mô¾e nadobúda» záporné hodnoty

source: nplurals = %lu but plural expression can produce values as large as %lu
sk: nplurals = %lu, ale výraz pre mno¾né èíslo mô¾e nadobúda» hodnoty väè¹ie ako %lu

source: plural expression can produce division by zero
sk: výraz pre mno¾né èíslo mô¾e spôsobi» delenie nulou

source: plural expression can produce integer overflow
sk: výraz pre mno¾né èíslo mô¾e spôsobi» celoèíselné preteèenie

source: plural expression can produce arithmetic exceptions, possibly division by zero
sk: výraz pre mno¾né èíslo mô¾e spôsobi» aritmetickú výnimku, pravdepodobne delenie nulou

source: message catalog has plural form translations...
sk: katalóg správ má preklady s mno¾nými èíslami...

source: ...but header entry lacks a "plural=EXPRESSION" attribute
sk: ...ale v hlavièke chýba "plural=VÝRAZ"

source: ...but header entry lacks a "nplurals=INTEGER" attribute
sk: ...ale v hlavièke chýba "nplurals=ÈÍSLO"

source: invalid nplurals value
sk: neplatná hodnota nplurals

source: invalid plural expression
sk: neplatný výraz pre mno¾né èíslo

source: ...but some messages have only one plural form
sk: ...ale niektoré správy majú len %lu tvarov mno¾ných èísel

source: ...but some messages have one plural form
sk: ...ale niektoré správy majú %lu tvarov mno¾ných èísel

source: Try using the following, valid for %s:
sk: Skúste pou¾i» nasledujúce, platné pre %s:

source: message catalog has plural form translations, but lacks a header entry with "Plural-Forms: nplurals=INTEGER; plural=EXPRESSION;"
sk: katalóg správ má preklady s mno¾nými èíslami, ale v hlavièke chýba "Plural-Forms: nplurals=ÈÍSLO; plural=VÝRAZ;"

source: `msgid' and `msgid_plural' entries do not both begin with '\n'
sk: polo¾ky `msgid' a `msgid_plural' nezaèínajú obe s '\n'

source: `msgid' and `msgstr[%u]' entries do not both begin with '\n'
sk: polo¾ky `msgid' a `msgstr[%u]' nezaèínajú obe s '\n'

source: `msgid' and `msgstr' entries do not both begin with '\n'
sk: polo¾ky `msgid' a `msgstr' nezaèínajú obe s '\n'

source: `msgid' and `msgid_plural' entries do not both end with '\n'
sk: polo¾ky `msgid' a `msgid_plural' nie sú obe ukonèené s '\n'

source: `msgid' and `msgstr[%u]' entries do not both end with '\n'
sk: polo¾ky `msgid' a `msgstr[%u]' nie sú obe ukonèené s '\n'

source: `msgid' and `msgstr' entries do not both end with '\n'
sk: polo¾ky `msgid' a `msgstr' nie sú obe ukonèené s '\n'

source: plural handling is a GNU gettext extension
sk: spracovanie mno¾ných èísel je roz¹írením GNU

source: '%s' is not a valid %s format string, unlike 'msgid'
sk: '%s' nie je platný formátovací re»azec %s, na rozdiel od 'msgid'

source: msgstr lacks the keyboard accelerator mark '%c'
sk: v msgstr chýba znaèka klávesovej skratky '%c'

source: msgstr has too many keyboard accelerator marks '%c'
sk: msgstr obsahuje príli¹ veµa znaèiek klávesových skratiek '%c'

source: headerfield `%s' missing in header
sk: hlavièková polo¾ka `%s' chýba v hlavièke

source: header field `%s' should start at beginning of line
sk: hlavièková polo¾ka `%s' má zaèína» na zaèiatku riadku

source: some header fields still have the initial default value
sk: niektoré polo¾ky hlavièky e¹te obsahujú poèiatoèné ¹tandardné hodnoty

source: field `%s' still has initial default value
sk: polo¾ka `%s' e¹te obsahuje poèiatoènú ¹tandardnú hodnotu

source: warning: PO file header missing or invalid
sk: upozornenie: hlavièka súboru PO chýba alebo je neplatná

source: warning: charset conversion will not work
sk: upozornenie: konverzia znakovej sady nebude fungova»

source: warning: PO file header fuzzy
sk: upozornenie: hlavièka súboru PO je nepresná

source: warning: older versions of msgfmt will give an error on this
sk: upozornenie: star¹ie verzie msgfmt vrátia pri tomto chybu

source: domain name "%s" not suitable as file name
sk: meno domény "%s" nie je pou¾itelné ako meno súboru

source: domain name "%s" not suitable as file name: will use prefix
sk: meno domény "%s" nie je pou¾itelné ako meno súboru: pou¾ije sa predpona

source: `domain %s' directive ignored
sk: direktíva `domain %s' bola ignorovaná

source: duplicate message definition
sk: duplicitná definícia správy

source: ...this is the location of the first definition
sk: ...toto je miesto prvého definovania

source: empty `msgstr' entry ignored
sk: prázdna polo¾ka `msgstr' bola ignorovaná

source: fuzzy `msgstr' entry ignored
sk: nepresná polo¾ka `msgstr' bola ignorovaná

source: %s: warning: source file contains fuzzy translation
sk: %s: upozornenie: zdrojový súbor obsahuje nepresné preklady

source: option '%c' cannot be used before 'K' or 'T' has been specified
sk: voµba '%c' nemô¾e by» pou¾itá pred ¹pecifikovaným 'K' alebo 'T'

source: Extracts all messages of a translation catalog that match a given pattern or belong to some given source files.
sk: Vyberie v¹etky správy z prekladového katalógu, ktoré vyhovujú zadanému vzoru alebo sú v zadaných zdrojových súboroch.

source: Message selection: [-N SOURCEFILE]... [-M DOMAINNAME]... [-K MSGID-PATTERN] [-T MSGSTR-PATTERN] [-C COMMENT-PATTERN] A message is selected if it comes from one of the specified source files, or if it comes from one of the specified domains, or if -K is given and its key (msgid or msgid_plural) matches MSGID-PATTERN, or if -T is given and its translation (msgstr) matches MSGSTR-PATTERN, or if -C is given and the translator's comment matches COMMENT-PATTERN. When more than one selection criterion is specified, the set of selected messages is the union of the selected messages of each criterion. MSGID-PATTERN or MSGSTR-PATTERN syntax: [-E | -F] [-e PATTERN | -f FILE]... PATTERNs are basic regular expressions by default, or extended regular expressions if -E is given, or fixed strings if -F is given. -N, --location=SOURCEFILE select messages extracted from SOURCEFILE -M, --domain=DOMAINNAME select messages belonging to domain DOMAINNAME -K, --msgid start of patterns for the msgid -T, --msgstr start of patterns for the msgstr -E, --extended-regexp PATTERN is an extended regular expression -F, --fixed-strings PATTERN is a set of newline-separated strings -e, --regexp=PATTERN use PATTERN as a regular expression -f, --file=FILE obtain PATTERN from FILE -i, --ignore-case ignore case distinctions
sk: Výber správy: [-N ZDROJOVÝSÚBOR]... [-M NÁZOVDOMÉNY]... [-K MSGID-VZOR] [-T MSGSTR-VZOR] [-C KOMENTÁR-VZOR] Správa je vybratá ak je z jedného zo zadaných zdrojových súborov, alebo ak je z jednej zo zadaných domén, alebo ak je zadané -K a jej kµúè (msgid alebo msgid_plural) vyhovuje vzoru MSGID-VZOR, alebo ak je zadané -T a jej preklad (msgstr) vyhovuje vzoru MSGSTR-VZOR, alebo ak je zadané -C a komentár prekladateµa vyhovuje vzoru KOMENTÁR-VZOR. Ak je zadaných viac ako jedno výberové kritérium, mno¾ina vybratých správ bude zjednotením vybratých správ jednotlivých kritérií. Syntax pre MSGID-VZOR a MSGSTR-VZOR: [-E | -F] [-e VZOR | -f SÚBOR]... VZORy sú ¹tandardne základné regulárne výrazy alebo, ak je zadané -E, roz¹írené regulárne výrazy alebo, ak je zadané -F, obyèajné re»azce. -N, --location=ZDROJOVÝSÚBOR vybra» správy extrahované zo súboru ZDROJOVÝSÚBOR -M, --domain=NÁZOVDOMÉNY vybra» správy patriacich do domény NÁZOVDOMÉNY -K, --msgid zaèiatok vzoru pre msgid -T, --msgstr zaèiatok vzoru pre msgstr -E, --extended-regexp VZOR je roz¹írený regulárny výraz -F, --fixed-strings VZOR je mno¾ina re»azcov oddelených znakom nový riadok -e, --regexp=VZOR pou¾i» VZOR ako regulárny výraz -f, --file=SÚBOR získa» VZOR zo SÚBORu -i, --ignore-case ignorova» rozlí¹enie veµkých a malých písmen

source: Output details: --no-escape do not use C escapes in output (default) --escape use C escapes in output, no extended chars --force-po write PO file even if empty --indent indented output style --no-location suppress '#: filename:line' lines --add-location preserve '#: filename:line' lines (default) --strict strict Uniforum output style -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines --sort-output generate sorted output --sort-by-file sort output by file location
sk: Podrobnosti výstupu: --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) --escape pou¾i» na výstupe riadiace sekvencie jazyka C bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny --indent zapísa» výstupný súbor s pou¾itím odsadzovania --no-location potlaèi» riadky '#: meno_súboru:riadok' --add-location zachova» riadky '#: meno_súboru:riadok' (predvolené) --strict zapísa» súbor s presne dodr¾aným ¹týlom Uniforum -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov --sort-outout generova» utriedený výstup --sort-by-file utriedi» výstup podµa umiestnenia v súboroch

source: write to grep subprocess failed
sk: zlyhal zápis do podprocesu grep

source: You are in a language indifferent environment. Please set your LANG environment variable, as described in the ABOUT-NLS file. This is necessary so you can test your translations.
sk: Ste v jazykovo neutrálnom prostredí. Prosím nastavte va¹u premennú prostredia LANG tak, ako je to uvedené v súbore ABOUT-NLS. Toto je potrebné na to, aby ste mohli otestova» va¹e preklady.

source: Output file %s already exists. Please specify the locale through the --locale option or the output .po file through the --output-file option.
sk: Výstupný súbor %s u¾ existuje. Zadajte, prosím, národné prostredie pomocou voµby --locale alebo výstupný .po súbor pomocou voµby --output-file.

source: Created %s.
sk: Vytvorený %s.

source: Creates a new PO file, initializing the meta information with values from the user's environment.
sk: Vytvorí nový PO súbor, inicializuje meta informácie podµa hodnôt z prostredia pou¾ívateµa.

source: Input file location: -i, --input=INPUTFILE input POT file If no input file is given, the current directory is searched for the POT file. If it is -, standard input is read.
sk: Umiestnenie vstupného súboru: -i, --input=VSTUPNÝSÚBOR vstupný POT súbor Ak nie je zadaný vstupný súbor, bude vyhµadaný POT súbor v aktuálnom adresári. Ak je -, naèítaný je ¹tandardný vstup.

source: Output file location: -o, --output-file=FILE write output to specified PO file If no output file is given, it depends on the --locale option or the user's locale setting. If it is -, the results are written to standard output.
sk: Umiestnenie výstupného súboru: -o, --output-file=SÚBOR zapísa» výstup do zadaného PO súboru Ak nie je zadaný výstupný súbor, tak je závislý od voµby --locale alebo od nastavenia národného prostredia pou¾ívateµa. Ak je -, výstup je zapísaný na ¹tandardný výstup.

source: Output details: -l, --locale=LL_CC set target locale --no-translator assume the PO file is automatically generated -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines
sk: Podrobnosti výstupu: -l, --locale=LL_CC nastavi» cieµové národné prostredie --no-translator oznaèi», ¾e PO súbor je generovaný automaticky -w, --width=ÈÍSLO nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov

source: Found more than one .pot file. Please specify the input .pot file through the --input option.
sk: Nájdených viac ako jeden .pot súbor. Prosím zadajte vstupný .pot súbor pomocou voµby --input.

source: error reading current directory
sk: chyba pri èítaní adresára
