Repository: autotools-mirror/gettext
Catalog: gettext-runtime/po/*.po
Languages: hr, pt, pt_br, sk

source: Found no .pot file in the current directory. Please specify the input .pot file through the --input option.
sk: V aktuálnom adresári nebol nájdený ¾iaden .pot súbor. Prosím zadajte vstupný .pot súbor pomocou voµby --input.

source: fdopen() failed
sk: fdopen() zlyhalo

source: %s subprocess I/O error
sk: V/V chyba podprocesu %s

source: %s subprocess failed with exit code %d
sk: podproces %s zlyhal s ukonèovacím kódom %d

source: The new message catalog should contain your email address, so that users can give you feedback about the translations, and so that maintainers can contact you in case of unexpected technical problems.
sk: Nový katalóg správ by mal obsahova» adresu elektronickej po¹ty, aby vám pou¾ívatelia mohli posla» pripomienky k prekladom a aby vás mohol správca kontaktova» v prípade neoèakávaných technických problémov.

source: English translations for %s package
sk: Slovenské preklady pre balík %s

source: present charset "%s" is not a portable encoding name
sk: aktuálna znaková sada "%s" nie je prenositeµné meno kódovania

source: two different charsets "%s" and "%s" in input file
sk: dve rozdielne znakové sady "%s" a "%s" vo vstupnom súbore

source: input file `%s' doesn't contain a header entry with a charset specification
sk: vstupný súbor "%s" nemá v hlavièke uvedenú znakovú sadu

source: domain "%s" in input file `%s' doesn't contain a header entry with a charset specification
sk: doména "%s" vo vstupnom súbore "%s" nemá v hlavièke uvedenú znakovú sadu

source: target charset "%s" is not a portable encoding name.
sk: cieµová znaková sada "%s" nie je prenositeµné meno kódovania.

source: warning:
sk: upozornenie:

source: Input files contain messages in different encodings, UTF-8 among others. Converting the output to UTF-8.
sk: Vstupné súbory obsahujú správy v rozdielnych kódovaniach, medzi inými aj v UTF-8. Konvertujem výstup do UTF-8.

source: Input files contain messages in different encodings, %s and %s among others. Converting the output to UTF-8. To select a different output encoding, use the --to-code option.
sk: Vstupné súbory obsahujú správy v rozdielnych kódovaniach, medzi inými aj v %s a v %s. Konvertujem výstup do UTF-8. Iné výstupné kódovanie si mô¾ete zvoli» pomocou voµby --to-code.

source: Locale charset "%s" is different from input file charset "%s". Output of '%s' might be incorrect. Possible workarounds are:
sk: Znaková sada "%s" pre národné prostredie je iná ako znaková sada vstupného súboru "%s". Výstup z '%s' mô¾e by» nesprávny. Mo¾né rie¹enia sú:

source: - Set LC_ALL to a locale with encoding %s.
sk: - Nastavi» LC_ALL na národné prostredie s kódovaním %s.

source: - Convert the translation catalog to %s using 'msgconv', then apply '%s', then convert back to %s using 'msgconv'.
sk: - Konvertova» prekladový katalóg na %s pomocou 'msgconv', potom pou¾i» '%s', potom konvertova» spä» na %s pomocou 'msgconv'.

source: - Set LC_ALL to a locale with encoding %s, convert the translation catalog to %s using 'msgconv', then apply '%s', then convert back to %s using 'msgconv'.
sk: - Nastavi» LC_ALL na národné prostreedie s kódovaním %s, konvertova» prekladový katalóg na %s pomocou 'msgconv', potom pou¾i» '%s', potom konvertova» spä» na %s pomocou 'msgconv'.

source: Locale charset "%s" is not a portable encoding name. Output of '%s' might be incorrect. A possible workaround is to set LC_ALL=C.
sk: Znaková sada "%s" pre národné prostredie nie je prenositeµný názov kódovania. Výstup z '%s' mô¾e by» nesprávny. Mo¾nou obchádzkou je nastavenie LC_ALL=C.

source: conversion failure
sk: konverzia zlyhala

source: input file doesn't contain a header entry with a charset specification
sk: vstupný súbor nemá v hlavièke uvedenú znakovú sadu

source: Cannot convert from "%s" to "%s". %s relies on iconv(), and iconv() does not support this conversion.
sk: Nemô¾em konvertova» z "%s" do "%s". %s spolieha na iconv() a iconv() nepodporuje takúto konverziu.

source: Cannot convert from "%s" to "%s". %s relies on iconv(). This version was built without iconv().
sk: Nemô¾em konvertova» z "%s" do "%s". %s spolieha na iconv(). Táto verzia bola prelo¾ená bez iconv().

source: backup type
sk: typ zálohy

source: Merges two Uniforum style .po files together. The def.po file is an existing PO file with translations which will be taken over to the newly created file as long as they still match; comments will be preserved, but extracted comments and file positions will be discarded. The ref.pot file is the last created PO file with up-to-date source references but old translations, or a PO Template file (generally created by xgettext); any translations or comments in the file will be discarded, however dot comments and file positions will be preserved. Where an exact match cannot be found, fuzzy matching is used to produce better results.
sk: Zlúèi dva .po súbory v ¹týle Uniforum do jedného. Súbor def.po je existujúci PO súbor s prekladmi, ktorý bude prevzatý do novovytvoreného súboru, pokiaµ si správy zodpovedajú; komentáre budú zachované, ale extrahované komentáre a pozície v súboroch nebudú zachované. Súbor ref.po je najnov¹í vytvorený PO súbor s aktuálnymi pozíciami v zdrojových súboroch, ale so starými prekladmi alebo ¹ablóna PO súboru (väè¹inou vytvorená programom xgettext); v¹etky preklady alebo komentáre v tomto súbore budú zmazané, okrem komentárov zaèínajúcich bodkou a informácií o pozícii v zdrojovom súbore. Pri správach, pri ktorých nie je mo¾né nájs» presnú zhodu, bude pou¾itý fuzzy algoritmus, ktorý dosahuje lep¹ie výsledky.

source: Input file location: def.po translations referring to old sources ref.pot references to new sources -D, --directory=DIRECTORY add DIRECTORY to list for input files search -C, --compendium=FILE additional library of message translations, may be specified more than once
sk: Umiestnenie vstupného súboru: def.po preklady podµa starých zdrojových súborov ref.pot odkazy na nové zdrojové súbory -D, --directory=ADRESÁR prida» ADRESÁR do zoznamu pre vyhµadávané vstupné súbory -C, --compendium=SÚBOR prídavna kni¾nica prekladov správ, mô¾e by» zadaná viac ako raz

source: Operation mode: -U, --update update def.po, do nothing if def.po already up to date
sk: Mód èinnosti: -U, --update aktualizova» def.po, nerobi» niè, ak def.po je aktuálny

source: Output file location in update mode: The result is written back to def.po. --backup=CONTROL make a backup of def.po --suffix=SUFFIX override the usual backup suffix The version control method may be selected via the --backup option or through the VERSION_CONTROL environment variable. Here are the values: none, off never make backups (even if --backup is given) numbered, t make numbered backups existing, nil numbered if numbered backups exist, simple otherwise simple, never always make simple backups The backup suffix is `~', unless set with --suffix or the SIMPLE_BACKUP_SUFFIX environment variable.
sk: Umiestnenie výstupného súboru v móde aktualizácie: Výsledok je zapísaný spä» do def.po. --backup=CONTROL vytvori» zálohu súboru def.po --suffix=PRÍPONA prekry» obvyklú príponu zálohy Kontrola verzií mô¾e by» zvolená cez voµbu --backup alebo cez premennú prostredia VERSION_CONTROL. Tú sú hodnoty: none, off nikdy nevytvára» zálohy (aj keï je zadané --backup) numbered, t vytvori» èíslovanú zálohu existing, nil numbered, ak existuje èíslovaná záloha, inak simple simple, never v¾dy vytvori» jednoduchú zálohu Prípona zálohy je '~', pokiaµ nie je zadaná voµba --suffix alebo nastavená premenná prostredia SIMPLE_BACKUP_SUFFIX.

source: Informative output: -h, --help display this help and exit -V, --version output version information and exit -v, --verbose increase verbosity level -q, --quiet, --silent suppress progress indicators
sk: Informatívny výstup: -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informáciu o verzii a skonèi» -v, --verbose zvý¹i» úroveò táravosti -q, --quiet, --silent potlaèi» indikátory postupu

source: this message should define plural forms
sk: táto správa by mala definova» tvary mno¾ného èísla

source: this message should not define plural forms
sk: táto správa by nemala definova» tvary mno¾ného èísla

source: %sRead %ld old + %ld reference, merged %ld, fuzzied %ld, missing %ld, obsolete %ld.
sk: %sNaèítané %ld starých + %ld odkazov, %ld zluèených, %ld nepresných, %ld chýbajucich, %ld zru¹ených.

source: done.
sk: hotovo.

source: %s and explicit file names are mutually exclusive
sk: %s a explicitné mená súborov sa navzájom vyluèujú

source: Usage: %s [OPTION] [FILE]...
sk: Pou¾itie: %s [VO¥BA] [SÚBOR]...

source: Convert binary message catalog to Uniforum style .po file.
sk: Konvertova» binárny katalóg správ na .po súbor v Uniforum ¹týle.

source: Operation mode: -j, --java Java mode: input is a Java ResourceBundle class --tcl Tcl mode: input is a tcl/msgcat .msg file
sk: Mód èinnosti: -j, --java mód Java: vstup je trieda Java ResourceBundle --tcl mód Tcl: vstup je súbor .msg tcl/msgcat

source: Input file location: FILE ... input .mo files If no input file is given or if it is -, standard input is read.
sk: Umiestnenie vstupného súboru: SÚBOR ... vstupný .mo súbor Ak nie je zadaný vstupný súbor alebo je -, je naèítaný ¹tandardný vstup.

source: Input file location in Java mode: -r, --resource=RESOURCE resource name -l, --locale=LOCALE locale name, either language or language_COUNTRY The class name is determined by appending the locale name to the resource name, separated with an underscore. The class is located using the CLASSPATH.
sk: Umiestnenie vstupného súbore v móde Java: -r, --rsource=ZDROJ názov zdroja -l, --locale=PROSTREDIE názov národného prostredia, buï jazyk alebo jazyk_KRAJINA Názov triedy je získaný pridaním názvu národného prostredia k názvu zdroja, oddelených znakom "_". Trieda je umiestnená pomocou CLASSPATH.

source: Input file location in Tcl mode: -l, --locale=LOCALE locale name, either language or language_COUNTRY -d DIRECTORY base directory of .msg message catalogs The -l and -d options are mandatory. The .msg file is located in the specified directory.
sk: Umiestnenie vstupného súboru v móde Tcl: -l, --locale=PROSTREDIE názov národného prostredia, buï jazyk alebo jazyk_KRAJINA -d ADRESÁR základný adresár katalógov správ .msg Voµby -l a -d sú povinné. Súbor .msg je umiestnený v zadaného adresára.

source: Output file location: -o, --output-file=FILE write output to specified file The results are written to standard output if no output file is specified or if it is -.
sk: Umiestnenie výstupného súboru: -o, --output-file=SÚBOR zapísa» výstup do zadaného súboru Výsledky sú zapísané na ¹tandardný výstup ak nie je zadaný výstupný súbor alebo ak je -.

source: Output details: -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent write indented output style --strict write strict uniforum style -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output
sk: Podrobnosti výstupu: -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent zapísa» výstupný súbor s pou¾itím odsadzovania --strict zapísa» súbor s presne dor¾aným ¹týlom uniforum -w, --width=©ÍRKA nastavi» ¹írku výstupnej strany --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-outout generova» utriedený výstup

source: Informative output: -h, --help display this help and exit -V, --version output version information and exit -v, --verbose increase verbosity level
sk: Informatívny výstup: -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informáciu o verzii a skonèi» -v, --verbose zvý¹i» úroveò táravosti

source: Unifies duplicate translations in a translation catalog. Finds duplicate translations of the same message ID. Such duplicates are invalid input for other programs like msgfmt, msgmerge or msgcat. By default, duplicates are merged together. When using the --repeated option, only duplicates are output, and all other messages are discarded. Comments and extracted comments will be cumulated, except that if --use-first is specified, they will be taken from the first translation. File positions will be cumulated. When using the --unique option, duplicates are discarded.
sk: Zjednotí duplikátne preklady v prekladovom katalógu. Nájde duplikátne preklady s rovnakými ID správ. Také duplikáty sú neplatné pre niektoré programy, napr. msgfmt, msgmerge alebo msgcat. ©tandardne sú duplikáty zlúèené dokopy. Pri pou¾ití voµby --repeated sú vypísané len duplikáty a v¹etky ostatné správy sú potlaèené. Komentáre a extrahované komentáre budú zlúèené; ak je pou¾itá voµba --use-first, budú získané z prvého prekladu. Pozície v súboroch budú zlúèené. Pri pou¾ití voµby --unique budú duplikáty potlaèené.

source: Message selection: -d, --repeated print only duplicates -u, --unique print only unique messages, discard duplicates
sk: Výber správy: -d, --repeated zobrazi» len duplikáty -u, --unique zobrazi» len unikátne správy, potlaèi» duplikáty

source: Usage: %s [OPTION] [TEXTDOMAIN] MSGID MSGID-PLURAL COUNT
hr: Uporaba: %s [OPCIJA] [TEKSTDOMENA] MSGID MSGID-PLURAL KOLIČINA
pt: Uso: %s [OPÇÃO] [DIALECTO] MSGID MSGID-PLURAL NÚMERO
pt_br: Uso: %s [OPÇÃO] [DOMÍNIOTEXTO] MSGID MSGID-PLURAL NÚMERO
sk: Pou¾itie: %s [VO¥BA] [DOMÉNA] ID_SPRÁVY ID_SPRÁVY-MNÈ POÈET

source: Display native language translation of a textual message whose grammatical form depends on a number.
hr: Ispiše prijevod tekstne poruke čiji gramatički oblik ovisi o broju
pt: Mostrar tradução de idioma nativo de uma mensagem textual cuja forma gramatical depende de um número.
pt_br: Exibe tradução de idioma nativo de uma mensagem textual cuja forma gramatical depende de um número.
sk: Zobrazi» preklad textovej správy, ktorej gramatický tvar závisí od èísla, do natívneho jazyka.

source: -d, --domain=TEXTDOMAIN retrieve translated message from TEXTDOMAIN -e enable expansion of some escape sequences -E (ignored for compatibility) -h, --help display this help and exit -V, --version display version information and exit [TEXTDOMAIN] retrieve translated message from TEXTDOMAIN MSGID MSGID-PLURAL translate MSGID (singular) / MSGID-PLURAL (plural) COUNT choose singular/plural form based on this value
sk: -d, --domain=DOMÉNA vybra» prelo¾ené správy z DOMÉNY -e povoli» rozvinutie niektorých riadiacich sekvencií znakov -E (bez významu; kvôli spätnej kompatibilite) -h, --help zobrazi» túto nápovedu a skonèi» -V, --version zobrazi» informácie o verzii a skonèi» [DOMÉNA] vybra» prelo¾enú správu z DOMÉNY ID_SPRÁVY ID_SPRÁVY-MNÈ prelo¾i» ID_SPRÁVY (jednotné èíslo) / ID_SPRÁVY-MNÈ (mno¾né èíslo) POÈET vybra» jednotné/mno¾né èíslo na základe tejto hodnoty

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. Standard search directory: %s
hr: Ako parametar TEKSTDOMENA nije naveden, domenu određuje varijabla okruženja TEXTDOMAIN. Ako katalog poruka nije pronađen u uobičajenom direktoriju, alternativna lokacija može se zadati varijablom okruženja TEXTDOMAINDIR. Uobičajeni direktorij za pretragu je: %s
pt: Se o parâmetro DIALECTO não for fornecido, o domínio é determinado a partir da variável de ambiente TEXTDOMAIN. Se o catálogo de mensagens não for encontrado na pasta habitual, pode ser especificada outra localização através da variável de ambiente TEXTDOMAINDIR. Pasta padrão de pesquisa: %s
pt_br: Se o parâmetro DOMÍNIOTEXTO não for informado, o domínio é determinado por meio da variável de ambiente TEXTDOMAIN. Se o catálogo de mensagens não for encontrado no diretório padrão, outro locale pode ser especificado na variável de ambiente TEXTDOMAINDIR. Diretório de pesquisa padrão: %s
sk: Ak nie je zadaný parameter DOMÉNA, doména bude prevzatá z premennej prostredia TEXTDOMAIN. Ak sa katalóg správ nenachádza v obvyklom adresári, iné umiestnenie mô¾e by» urèené obsahom premennej prostredia TEXTDOMAINDIR. ©tandardný adresár, v ktorom sa budú hµada» katalógy: %s

source: <stdin>
sk: <¹tandardný vstup>

source: %s: warning:
sk: %s: upozornenie:

source: Charset "%s" is not a portable encoding name. Message conversion to user's charset might not work.
sk: Znaková sada "%s" nie je prenositeµné meno kódovania. Konverzia hlásení do znakovej sady pou¾ívateµa nemusí fungova».

source: Continuing anyway, expect parse errors.
sk: Pokraèovanie aj napriek tomu. Mo¾no sa vyskytnú chyby pri analýze.

source: Continuing anyway.
sk: Pokraèovanie aj napriek tomu.

source: Charset "%s" is not supported. %s relies on iconv(), and iconv() does not support "%s".
sk: Znaková sada "%s" nie je podporovaná. %s spolieha na iconv() a iconv() nepodporuje "%s".

source: Installing GNU libiconv and then reinstalling GNU gettext would fix this problem.
sk: In¹talácia GNU balíka libiconv a následná prein¹talácia balíka GNU gettext by mala tento problém odstráni».

source: Charset "%s" is not supported. %s relies on iconv(). This version was built without iconv().
sk: Znaková sada "%s" nie je podporovaná. %s spolieha na iconv(). Táto verzia bola prelo¾ená bez iconv().

source: Charset missing in header. Message conversion to user's charset will not work.
sk: V hlavièke chýba znaková sada. Konverzia hlásení do znakovej sady pou¾ívateµa nebude fungova».

source: inconsistent use of #~
sk: nekonzistentné pou¾itie #~

source: missing `msgstr[]' section
sk: chýba sekcia `msgstr[]'

source: missing `msgid_plural' section
sk: chýba sekcia `msgid_plural'

source: missing `msgstr' section
sk: chýba sekcia `msgstr'

source: first plural form has nonzero index
sk: prvé mno¾né èíslo má nenulový index

source: plural form has wrong index
sk: mno¾né èíslo má nesprávny index

source: too many errors, aborting
sk: vyskytlo sa príli¹ veµa chýb, ukonèuje sa program

source: invalid multibyte sequence
sk: neplatná viacznaková sekvencia

source: incomplete multibyte sequence at end of file
sk: nekompletná viacznaková sekvencia na konci súboru

source: incomplete multibyte sequence at end of line
sk: nekompletná viacznaková sekvencia na konci riadku

source: iconv failure
sk: iconv zlyhal

source: error while reading "%s"
hr: greška pri čitanju „%s’
pt: erro ao ler "%s"
pt_br: erro ao ler "%s"
sk: chyba pri èítaní súboru "%s"

source: keyword "%s" unknown
sk: neznáme kµúèové slovo "%s"

source: invalid control sequence
sk: neplatná riadiaca sekvencia

source: end-of-file within string
sk: koniec súboru uprostred re»azca

source: end-of-line within string
sk: koniec riadku uprostred re»azca

source: file "%s" is truncated
sk: súbor "%s" je skrátený

source: file "%s" contains a not NUL terminated string
sk: súbor "%s" obsahuje re»azce, ktoré nie sú ukonèené nulou

source: file "%s" is not in GNU .mo format
sk: súbor "%s" nie je vo formáte GNU .mo

source: file "%s" contains a not NUL terminated string, at %s
sk: súbor "%s" obsahuje re»azec, ktorý nie je ukonèený nulou, na %s

source: expected two arguments
sk: oèakávané dva parametre

source: Usage: %s [OPTION] URL FILE
sk: Pou¾itie: %s [VO¥BA] URL SÚBOR

source: Fetches and outputs the contents of an URL. If the URL cannot be accessed, the locally accessible FILE is used instead.
sk: Stiahne a zobrazí obsah z URL. Ak URL nie je dostupné, pou¾ije sa SÚBOR z lokálneho disku.

source: error writing stdout
sk: chyba pri zápise na ¹tandardný výstup

source: cannot find a temporary directory, try setting $TMPDIR
sk: nemô¾em nájs» doèasný adresár, skúste nastavi» $TMPDIR

source: cannot create a temporary directory using template "%s"
sk: nemô¾em vytvori» doèasný adresár so ¹ablónou "%s"

source: not a valid Java class name: %s
sk: nie je platným názvom triedy Java: %s

source: failed to create "%s"
sk: zlyhalo vytvorenie "%s"

source: error while writing "%s" file
sk: chyba poèas zápisu do súboru "%s"

source: compilation of Java class failed, please try --verbose or set $JAVAC
sk: kompilácia triedy Java zlyhalo, prosím skúste --verbose alebo nastavte $JAVAC

source: error while opening "%s" for writing
sk: chyba pri otváraní súboru "%s" na zápis

source: internationalized messages should not contain the `\%c' escape sequence
sk: internacionalizované správy nesmú obsahova» riadiacu sekvenciu `\%c'

source: The following msgid contains non-ASCII characters. This will cause problems to translators who use a character encoding different from yours. Consider using a pure ASCII msgid instead. %s
sk: Nasledujúci msgid obsahuje znaky mimo ASCII. Toto spôsobí problémy prekladateµom, ktorí pou¾ívajú iné kódovanie znakov ako vy. Zvá¾te namiesto to pou¾itie msgid len s ASCII znakmi. %s

source: cannot create output file "%s"
sk: nie je mo¾né vytvori» výstupný súbor "%s"

source: standard output
sk: ¹tandardný výstup

source: %s:%d: warning: unterminated character constant
sk: %s:%d: upozornenie: neukonèená znaková kon¹tanta

source: %s:%d: warning: unterminated string literal
sk: %s:%d: upozornenie: neukonèený znakový re»azec

source: this file may not contain domain directives
sk: tento súbor nesmie obsahova» direktívy pre doménu

source: %s:%d: invalid string definition
sk: %s:%d: neplatná definícia re»azca

source: %s:%d: missing number after #
sk: %s:%d: chýbajúce èíslo za #

source: %s:%d: invalid string expression
sk: %s:%d: neplatný výraz re»azca

source: --join-existing cannot be used when output is written to stdout
sk: --join-existing nesmie by» pou¾ité ak je výstup posielaný na ¹tandardný výstup

source: xgettext cannot work without keywords to look for
sk: xgettext nemô¾e pracova» bez kµúèových slov, ktoré má hµada»

source: warning: file `%s' extension `%s' is unknown; will try C
sk: upozornenie: súbor `%s' s príponou `%s' je neznámy; skúsim C

source: Extract translatable strings from given input files.
sk: Extrahova» prelo¾iteµné re»azce zo zadaných vstupných súborov.

source: Mandatory arguments to long options are mandatory for short options too. Similarly for optional arguments.
sk: Povinné parametre dlhých volieb sú povinné aj pre krátke voµby. Podobne aj pre voliteµné parametre.

source: Output file location: -d, --default-domain=NAME use NAME.po for output (instead of messages.po) -o, --output=FILE write output to specified file -p, --output-dir=DIR output files will be placed in directory DIR If output file is -, output is written to standard output.
sk: Umiestnenie výstupného súboru: -d, --default-domain=NÁZOV pou¾i» NÁZOV.po pre výstup (namiesto messages.po) -o, --output=SÚBOR zapísa» výstup do zadaného súboru -p, --output-dir=ADRESÁR výstupné súbory budú umiestnené v adresári ADRESÁR Ak je výstupný súbor -, výstup je zapísaný na ¹tandardný výstup.

source: Operation mode: -j, --join-existing join messages with existing file -x, --exclude-file=FILE.po entries from FILE.po are not extracted -c, --add-comments[=TAG] place comment block with TAG (or those preceding keyword lines) in output file
sk: Mód èinnosti: -j, --join-existing spoji» správy s existujúcim súborom -x, --exclude-file=SÚBOR.po polo¾ky zo súboru SÚBOR.po nie sú extrahované -c, --add-comments[=TAG] umiestni» blok komentára obsahujúci TAG (alebo tie, ktoré predchádzajú kµúèové riadky) do výstupného súboru
