Repository: autotools-mirror/gettext
Catalog: gettext-runtime/po/*.po
Languages: hr, pt, pt_br, sk

source: Language=C/C++ specific options: -a, --extract-all extract all strings -k, --keyword[=WORD] additional keyword to be looked for (without WORD means not to use default keywords) -T, --trigraphs understand ANSI C trigraphs for input --debug more detailed formatstring recognition result
sk: ©pecifické voµby pre Language=C/C++: -a, --extract-all extrahova» v¹etky re»azce -k, --keyword[=SLOVO] ïal¹ie kµúèové slovo, ktoré bude vyhµadané (bez SLOVO znamená: nepou¾i» predvolené kµúèové slová -T, --trigraphs pozna» ANSI C trojznaky na vstupe --debug detailnej¹ie výsledky rozoznávania formátovacích re»azcov

source: Output details: -e, --no-escape do not use C escapes in output (default) -E, --escape use C escapes in output, no extended chars --force-po write PO file even if empty -i, --indent write the .po file using indented style --no-location do not write '#: filename:line' lines -n, --add-location generate '#: filename:line' lines (default) --strict write out strict Uniforum conforming .po file -w, --width=NUMBER set output page width --no-wrap do not break long message lines, longer than the output page width, into several lines -s, --sort-output generate sorted output -F, --sort-by-file sort output by file location --omit-header don't write header with `msgid ""' entry --copyright-holder=STRING set copyright holder in output --foreign-user omit FSF copyright in output for foreign user -m, --msgstr-prefix[=STRING] use STRING or "" as prefix for msgstr entries -M, --msgstr-suffix[=STRING] use STRING or "" as suffix for msgstr entries
sk: Podrobnosti výstupu: -e, --no-escape nepou¾i» na výstupe riadiace sekvencie jazyka C (predvolené) -E, --escape pou¾i» na výstupe riadiace sekvencie jazyka C, bez roz¹írených znakov --force-po zapísa» súbor PO, aj keï bude prázdny -i, --indent zapísa» .po súbor s pou¾itím odsadzovania --no-location nezapisova» riadky '#: meno_súboru:riadok' -n, --add-location generova» riadky '#: meno_súboru:riadok' (predvolené) --strict zapísa» .po súbor presne dor¾iavajúci ¹týl Uniforum -w, --width=ÈÍSLO nastavi» ¹írku strany výstupu --no-wrap nezalamova» dlhé riadky sráv, dlh¹ie ako ¹írka výstupnej strany, do viacerých riadkov -s, --sort-output generova» utriedený výstup -F, --sort-by-file utriedi» výstup podµa umiestnenia v súboroch --omit-header nezapisova» hlavièku s polo¾kou 'msgid ""' --copyright-holder=RE«AZEC nastavi» dr¾iteµa autorských práv vo výstupe --foreign-user vynecha» informáciu o autorských právach FSF pre cudzieho pou¾ívateµa -m, --msgstr-prefix[=RE«AZEC] pou¾i» RE«AZEC alebo "" ako predponu pre polo¾ky msgstr -M, --msgstr-suffix[=RE«AZEC] pou¾i» RE«AZEC alebo "" ako príponu pre polo¾ky msgstr

source: standard input
hr: standardni ulaz
pt: entrada padrão
pt_br: entrada padrão
sk: ¹tandardný vstup

source: Empty msgid. It is reserved by GNU gettext: gettext("") returns the header entry with meta information, not the empty string.
sk: Prázdne msgid. To je vyhradené pre GNU gettext: gettext("") vráti hlavièku s meta informáciami a nie prázdny re»azec.

source: language `%s' unknown
sk: jazyk `%s' je neznámy

source: Copyright (C) %s Free Software Foundation, Inc. License GPLv3+: GNU GPL version 3 or later <%s> This is free software: you are free to change and redistribute it. There is NO WARRANTY, to the extent permitted by law.
hr: Copyright (C) %s Free Software Foundation, Inc. Licenca GPLv3+: GNU GPL inačica 3 ili novija <%s> Ovo je slobodan softver: slobodno ga mijenjajte i dijelite. NEMA JAMSTVA do granica dopuštenih zakonom.
pt: Copyright (C) %s Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior <%s> Este software é grátis: pode alterá-lo e redistribuí-lo. Não há QUALQUER GARANTIA, até ao limite da Lei.
pt_br: Copyright (C) %s Free Software Foundation, Inc. Licença GPLv3+: GNU GPL versão 3 ou posterior <%s> Este é um software livre: você é livre para alterá-lo e redistribui-lo. NÃO HÁ QUALQUER GARANTIA, na máxima extensão permitida em lei.

source: Try '%s --help' for more information.
hr: Utipkajte ‘%s --help’ za pomoć i više informacija.
pt: Tente "%s --help" para mais informação.
pt_br: Tente "%s --help" para mais informações.

source: Usage: %s [OPTION] [SHELL-FORMAT]
hr: Uporaba: %s [OPCIJA] [FORMAT-LJUSKE]
pt: Uso: %s [OPÇÃO] [FORMATO-SHELL]
pt_br: Uso: %s [OPÇÃO] [FORMATO SHELL]

source: Substitutes the values of environment variables.
hr: Zamjenjuje vrijednosti varijabli okruženja.
pt: Substitui os valores das variáveis de ambiente.
pt_br: Substitui os valores das variáveis de ambiente.

source: Operation mode:
hr: Način rada (mode):
pt: Modo de operação:
pt_br: Modo de operação:

source: -v, --variables output the variables occurring in SHELL-FORMAT
hr: -v, --variables ispiše varijable koje se javljaju u FORMAT-LJUSKE
pt: -v, --variables mostra as variáveis em FORMATO-SHELL
pt_br: -v, --variables exibe as variáveis ocorrentes em SHELL-FORMAT

source: Informative output:
hr: Informativni izlaz:
pt: Saída informativa:
pt_br: Saída informativa:

source: -h, --help display this help and exit
hr: -h, --help pokaže ovu pomoć i iziđe
pt: -h, --help mostra esta mensagem e sai
pt_br: -h, --help exibe essa ajuda e sai

source: -V, --version output version information and exit
hr: -V, --version informira o inačici ovog programa i iziđe
pt: -V, --version mostra informação da versão e sai
pt_br: -V, --version exibe a informação da versão e sai

source: In normal operation mode, standard input is copied to standard output, with references to environment variables of the form $VARIABLE or ${VARIABLE} being replaced with the corresponding values. If a SHELL-FORMAT is given, only those environment variables that are referenced in SHELL-FORMAT are substituted; otherwise all environment variables references occurring in standard input are substituted.
hr: U običnom načinu rada standardni ulaz kopira se na standardni izlaz, s time da se referencije na varijable okruženja u formatu $VARIJABLA ili ${VARIJABLA} zamijene odgovarajućim vrijednostima. Ako je navedeni argument FORMAT-LJUSKE, onda će samo one varijable okruženja s referencijom u FORMAT-LJUSKE biti zamijenjene; u suprotnom, sve varijable okruženja koje se pojavljuju na standardnom ulazu bit će zamijenjene.
pt: Em modo de operação normal, a entrada padrão é copiada para a saída padrão, com referências a variáveis de ambiente da forma $VARIÁVEL ou ${VARIÁVEL} sendo substituídas com os valores correspondentes. Se um FORMATO-SHELL for dado, apenas essas variáveis de ambiente referenciadas em FORMATO-SHELL são substituídas; caso contrário, todas as variáveis de ambiente referenciadas ocorrentes na entrada padrão são substituídas.
pt_br: Em modo de operação normal, a entrada padrão é copiada para a saída padrão, com referências a variáveis de ambiente da forma de $VARIABLE ou ${VARIABLE} sendo substituída com os valores correspondentes. Se um FORMATO-SHELL é dado, apenas aquelas variáveis de ambiente que forem referenciadas no FORMATO-SHELL são substituídas. Do contrário, todas as referências variáveis de ambiente ocorrentes na entrada padrão são substituídas.

source: When --variables is used, standard input is ignored, and the output consists of the environment variables that are referenced in SHELL-FORMAT, one per line.
hr: Ako se koristi --variables, standardni ulaz je zanemaren, a izlaz se sastoji od onih varijabli okruženja s referencijom u FORMAT-LJUSKE, po jedna po retku.
pt: Quando --variables é usado, a entrada padrão é ignorada e a saída consiste nas variáveis de ambiente referenciadas em FORMATO-SHELL, uma por linha.
pt_br: Quando --variables é usado, a entrada padrão é ignorada e a saída conste nas variáveis de ambiente que são referenciadas em FORMATO-SHELL, um por linha.

source: Report bugs in the bug tracker at <%s> or by email to <%s>.
hr: Greške prijavite u ‘bug tracker’ na <%s> ili e-poštom na <%s>.
pt: Reporte erros no sistema de rastreio em <%s> ou por email para <%s>. Reporte erros de tradução em <translation-team-pt@lists.sourceforge.net>
pt_br: Relate erros no rastreador em <%s> ou por e-mail para <%s>. Relate erros de tradução para <https://translationproject.org/team/pt_BR.html>

source: Options and arguments:
hr: Opcije i argumenti:
pt: Opções e argumentos:
pt_br: Opções e argumentos:

source: -d, --domain=TEXTDOMAIN retrieve translated messages from TEXTDOMAIN
hr: -d, --domain=TEKSTDOMENA traži prevedene poruke iz TEKSTDOMENE
pt: -d, --domain=DOMTEXTO.. obtém mensagens traduzidas de DOMTEXTO
pt_br: -d, --domain=DOMÍNIOTEXTO obtém mensagens traduzidas de DOMÍNIOTEXTO

source: -c, --context=CONTEXT specify context for MSGID
hr: -c, --context=KONTEKST specifikacija konteksta za MSGID
pt: -c, --context=CONTEXTO especifica contexto para MSGID
pt_br: -c, --context=CONTEXTO especifica contexto para MSGID

source: -e enable expansion of some escape sequences
hr: -e omogući ekspanziju nekih maskiranih (escape) nizova
pt: -e activa expansão de algumas sequências de escape
pt_br: -e habilita expansão de algumas sequências de escape

source: -n suppress trailing newline
hr: -n ne ostavlja prazni redak na kraju datoteke
pt: -n suprime nova linha final
pt_br: -n suprime nova linha ao final

source: -E (ignored for compatibility)
hr: -E (zanemareno zbog kompatibilnosti)
pt: -E (ignorado para compatibilidade)
pt_br: -E (ignorado por questão de compatibilidade)

source: [TEXTDOMAIN] MSGID retrieve translated message corresponding to MSGID from TEXTDOMAIN
hr: [TEKSTDOMENA] MSGID preuzme prevedenu poruku koja odgovara navedenom MSGID-u iz TEKSTDOMENE
pt: [DOMTEXTO] MSGID obtém a mensagem traduzida correspondente a MSGID de DOMTEXTO
pt_br: [DOMÍNIOTEXTO] MSGID obtém mensagem traduzida correspondendo a MSGID de DOMÍNIOTEXTO

source: -h, --help display this help and exit
hr: -h, --help pokaže ovu pomoć i iziđe
pt: -h, --help mostra esta mensagem e sai
pt_br: -h, --help exibe essa ajuda e sai

source: -V, --version display version information and exit
hr: -V, --version informira o inačici ovog programa i iziđe
pt: -V, --version mostra informação da versão e sai
pt_br: -V, --version exibe a informação da versão e sai

source: If the TEXTDOMAIN parameter is not given, the domain is determined from the environment variable TEXTDOMAIN. If the message catalog is not found in the regular directory, another location can be specified with the environment variable TEXTDOMAINDIR. When used with the -s option the program behaves like the 'echo' command. But it does not simply copy its arguments to stdout. Instead those messages found in the selected catalog are translated. Standard search directory: %s
hr: Ako parametar TEKSTDOMENA nije naveden, domenu određuje varijabla okruženja TEXTDOMAIN. Ako katalog poruka nije pronađen u uobičajenom direktoriju, alternativna lokacija može se zadati varijablom okruženja TEXTDOMAINDIR. Kad se koristi opcija -s, program se ponaša kao naredba ‘echo’; ali umjesto jednostavnog ispisa svih svojih argumenata, program ispiše njihove prijevode ako ih nađe u odabranom katalogu (TEKSTDOMENA). Uobičajeni direktorij za pretragu je: %s
pt: Se o parâmetro DIALECTO não for fornecido, o domínio é determinado a partir da variável de ambiente TEXTDOMAIN. Se o catálogo de mensagens não for encontrado na pasta habitual, pode ser especificada outra localização através da variável de ambiente TEXTDOMAINDIR. Quando usado com a opção -s, o programa comporta-se como o comando "echo". Mas ele não copia simplesmente os seus argumentos para a saída padrão. Ao invés, as mensagens encontradas no catálogo seleccionado são traduzidas. Pasta padrão de pesquisa: %s
pt_br: Se o parâmetro DOMÍNIOTEXTO não for informado, o domínio é determinado por meio da variável de ambiente TEXTDOMAIN. Se o catálogo de mensagens não for encontrado no diretório padrão, outro locale pode ser especificado na variável de ambiente TEXTDOMAINDIR. Quando USADO com a opção -s o programa comporta-se como o comando "echo". Mas não somente copiando seus parâmetros para stdout, e sim traduzindo as mensagens encontradas no catálogo selecionado Diretório de pesquisa padrão: %s

source: -d, --domain=TEXTDOMAIN retrieve translated message from TEXTDOMAIN
hr: -d, --domain=TEKSTDOMENA preuzme prevedene poruke iz TEKSTDOMENE
pt: -d, --domain=DOMTEXTO obtém a mensagem traduzida de DOMTEXTO
pt_br: -d, --domain=DOMÍNIOTEXTO obtém mensagem traduzida de DOMÍNIOTEXTO

source: [TEXTDOMAIN] retrieve translated message from TEXTDOMAIN
hr: [TEKSTDOMENA] preuzme prevedene poruke iz TEKSTDOMENE
pt: [DOMTEXTO] obtém a mensagem traduzida de DOMTEXTO
pt_br: [DOMÍNIOTEXTO] obtém mensagem traduzida de DOMÍNIOTEXTO

source: MSGID MSGID-PLURAL translate MSGID (singular) / MSGID-PLURAL (plural)
hr: MSGID MSGID-PLURAL prevede MSGID (singular) / MSGID-PLURAL (plural)
pt: MSGID MSGID-PLURAL traduz MSGID (singular) / MSGID-PLURAL (plural)
pt_br: MSGID MSGID-PLURAL traduzi MSGID (singular) / MSGID-PLURAL (plural)

source: COUNT choose singular/plural form based on this value
hr: KOLIČINA odabere singular ili plural prema KOLIČINI
pt: TOTAL escolhe a forma singular/plural baseado neste valor
pt_br: NÚMERO escolhe forma singular/plural com base nesse valor

source: In the directive number %zu, the argument number 0 is not a positive integer.
hr: U direktivi broj %zu, argument s brojem 0 nije pozitivni cijeli broj.
pt: Na directiva número %zu, o argumento 0 não é um inteiro positivo.
pt_br: Na diretiva de número %zu, o argumento de número 0 não é um inteiro positivo.

source: The string ends in the middle of a directive.
hr: String je završio u sredini direktive.
pt: A cadeia termina no meio de uma directiva.
pt_br: A string termina no meio de uma diretiva.

source: In the directive number %zu, the character '%c' is not a valid conversion specifier.
hr: U direktivi broj %zu, znak ‘%c’ nije valjani specifikator konverzije.
pt: Na directiva número %zu, o carácter "%c" não é um especificador de conversão válido.
pt_br: Na diretiva de número %zu, o caractere "%c" não é um especificador de conversão válido.

source: The character that terminates the directive number %zu is not a valid conversion specifier.
hr: Znak kojim završava direktiva broj %zu nije valjani specifikator konverzije.
pt: O carácter que termina a directiva número %zu não é um especificador de conversão válido.
pt_br: O caractere que termina a diretiva de número %zu não é um especificador de conversão válido.

source: In the directive number %zu, the flag '%c' is invalid for the conversion '%c'.
hr: U direktivi broj %zu, flag ‘%c’ nije valjan za konverziju ‘%c’.
pt: Na directiva nṹmero %zu, a bandeira "%c" é inválida para a conversão "%c".
pt_br: Na diretiva de número %zu, a sinalização "%c" é inválida para a conversão "%c".

source: The string refers to arguments both through absolute argument numbers and through unnumbered argument specifications.
hr: String referira na argumente istovremeno putem apsolutnih brojeva argumenata i putem specifikacija nenumeriranih argumenata.
pt: A cadeia refere-se a argumentos tanto por números de argumento absolutos como por especificações de argumento não numeradas.
pt_br: A string faz referência a argumentos por meio de números de argumento absolutos e por especificações de argumento sem número.

source: The string ends in the middle of an escape sequence.
hr: String je završio u sredini maskiranog (escape) niza.
pt: A cadeia termina no meio de uma sequência de escape.
pt_br: A string termina no meio da diretiva de uma sequência de escape.

source: The escape sequence '%c%c' is unsupported (not in POSIX).
hr: Maskirani (escape) niz ‘%c%c’ nije podržan (ne u POSIX).
pt: A sequência de escape "%c%c" não é suportada (em POSIX).
pt_br: A sequência de escape "%c%c" não é suportada (não no POSIX).

source: The escape sequence '%c%c' is invalid.
hr: Maskirani (escape) niz ‘%c%c’ nije valjan.
pt: A sequência de escape "%c%c" é inválida.
pt_br: A sequência de escape "%c%c" é inválida.

source: This escape sequence is invalid.
hr: Ovaj maskirani (escape) niz nije valjan.
pt: A sequência de escape é inválida.
pt_br: Esta sequência de escape é inválida.

source: write error
hr: greška pri pisanju
pt: erro de escrita
pt_br: erro de escrita

source: %s: expected a numeric value
hr: %s: očekivana je numerička vrijednost
pt: %s: esperado um valor numérico
pt_br: %s: esperava-se um valor numérico

source: %s: value not completely converted
hr: %s: ova vrijednost nije u potpunosti konvertirana
pt: %s: valor não completamente convertido
pt_br: %s: valor não foi convertido totalmente

source: The translated format string consumes %zu arguments, whereas the original format string consumes only %zu arguments.
hr: Prevedeni string formata zahtijeva %zu argumenata, dok izvorni string formata zahtijeva samo %zu argumenata.
pt: A cadeia de formato traduzida consome %zu argumentos, enquanto a cadeia de formato original consome só %zu argumentos.
pt_br: A string de formato traduzida consome %zu argumentos, sendo que a string de formato original consome apenas %zu argumentos.

source: warning: ignoring excess arguments, starting with %s
hr: upozorenje: ignoriramo suvišne argumente, počevši s %s
pt: aviso: a ignorar argumentos excessivos, a começar por %s
pt_br: aviso: ignorando argumentos excessivos, começando com %s

source: missing format string
hr: nedostaje string formata
pt: cadeia de formato em falta
pt_br: faltando string de formato

source: Usage: %s [OPTION] FORMAT [ARGUMENT]...
hr: Uporaba: %s [OPCIJA] FORMAT [ARGUMENT]...
pt: Uso: %s [OPÇÃO] FORMATO [ARGUMENTO]...
pt_br: Uso: %s [OPÇÃO] FORMATO [ARGUMENTO]...

source: Produces formatted output, applying the native language translation of FORMAT to the ARGUMENTs.
hr: Generira formirani izlaz podataka primijenom prijevoda FORMATA na ARGUMENTE
pt: Produz saída formatada, aplicando a tradução do idioma nativo de FORMATO para os ARGUMENTOs.
pt_br: Produz saída formatada, aplicando a tradução do idioma nativo de FORMATO para os ARGUMENTOs.

source: -c, --context=CONTEXT specify context for FORMAT
hr: -c, --context=KONTEKST specifikacija konteksta za FORMAT
pt: -c, --context=CONTEXTO especifica o contexto de FORMATO
pt_br: -c, --context=CONTEXTO especifica contexto para formato

source: FORMAT format string
hr: FORMAT string formata
pt: FORMATO cadeia de formato
pt_br: FORMATO string de formato

source: ARGUMENT string or numeric argument
hr: ARGUMENT string ili numerički argument
pt: ARGUMENTO cadeia ou argumento numérico
pt_br: ARGUMENTO string ou argumento numérico

source: The format string consists of - plain text, - directives, that start with '%c', - escape sequences, that start with a backslash.
hr: Format string sastoji se od - obični tekst, - direktiva, koja počinjue s ‘%c’, - maskirani (escape) nizovi, koji započinju s obrnutom kosom crtom, backslash.
pt: A cadeia de formato consiste em - texto simples, - directivas, que começam com "%c", - sequências de escape, que começam com "\".
pt_br: A string de formato consiste em - texto simples, - diretivas, que começam com "%c", - sequências de escape, que começam com uma barra invertida.

source: A directive that consumes an argument - starts with '%s' or '%s' where %s is a positive integer, - is optionally followed by any of the characters '%c', '%c', '%c', '%c', '%c', each of which acts as a flag, - is optionally followed by a width specification (a nonnegative integer), - is optionally followed by '%c' and a precision specification (an optional nonnegative integer), - is finished by a specifier - '%c', that prints a character, - '%c', that prints a string, - '%c', '%c', that print an integer, - '%c', '%c', '%c', '%c', that print an unsigned (nonnegative) integer, - '%c', '%c', that print a floating-point number in scientific notation, - '%c', '%c', that print a floating-point number without an exponent, - '%c', '%c', that print a floating-point number in general notation, - '%c', '%c', that print a floating-point number in hexadecimal notation. Additionally there is the directive '%s', that prints a single '%c'.
hr: Direktiva koja koristi argument - počinje s ‘%s’ ili ‘%s’ gdje je %s pozitivni cijeli broj, - zatim, opcionalno slijede bilo koji od znakova ‘%c’, ‘%c’, ‘%c’, ‘%c’, ‘%c’, a svaki od njih djeluje kao flag, - zatim, opcionalno slijedi specifikacija širine (nenegativni cijeli broj), - zatim, opcionalno slijede ‘%c’ i specifikacijom preciznosti (neobavezni nenegativni cijeli broj), - a završi sa specifikatorom - ‘%c’, ispiše znak, - ‘%c’, ispiše string, - ‘%c’, ‘%c’, ispiše cijeli broj, - ‘%c’, ‘%c’, ‘%c’, ‘%c’, ispiše neoznačeni (nenegativni) cijeli broj, - ‘%c’, ‘%c’, ispiše broj s plutajućim zarezom u znanstvenoj notaciji, - ‘%c’, ‘%c’, ispiše broj s plutajućim zarezom bez esponenta, - ‘%c’, ‘%c’, ispiše broj s plutajućim zarezom u standardnoj notaciji, - ‘%c’, ‘%c’, ispiše broj s plutajućim zarezom u heksadekadskoj notaciji. Osim toga, postoji direktiva '%s', koja ispiše samo jedan ‘%c’.
pt: Uma directiva que consome um argumento - começa com "%s" ou "%s" onde %s é um inteiro positivo, - é optionalmente seguida por um dos caracteres "%c", "%c", "%c", "%c", "%c", cada um actuando como bandeira, - é optionalmente seguido por uma especificação de largura (um inteiro não negativo), - é optionalmente seguido de "%c" e uma especificação de precisão (um inteiro não negativo opcional), - termina por um especificador - "%c", que imprime um carácter, - '%c', que imprime uma cadeia, - '%c', '%c', que imprime um inteiro, - '%c', '%c', '%c', '%c', que imprime um inteiro sem sinal ((não negativo), - '%c', '%c', que imprime um número de vírgula flutuante em notação cietífica, - '%c', '%c', que imprime um número de vírgula flutuante sem expoente, - '%c', '%c', que imprime um número de vírgula flutuante em notação geral, - '%c', '%c', que imprime um número de vírgula flutuante em notação hexadecinal. Adicionalmente, há a directiva "%s", que imprime um único "%c".
pt_br: Uma diretiva que consome um argumento - começa com "%s" ou "%s" onde %s é um inteiro positivo, - é opcionalmente seguido por qualquer um dos caracteres "%c", "%c", "%c", "%c", "%c", cada um dos quais se comporta como um sinalizador, - é opcionalmente seguido por uma especificação de largura (um inteiro não negativo), - é opcionalmente seguido por "%c" e uma especificação de precisão (um inteiro não negativo opcional), - é finalizado por um especificador - "%c", que imprime um caractere, - "%c", que imprime uma string, - "%c", "%c", que imprime um inteiro, - "%c", "%c", "%c", "%c", que imprime um inteiro sem sinal (não negativo), - "%c", "%c", que imprime um número de ponto flutuante em notação científica, - "%c", "%c", que imprime um número de ponto flutuante número sem expoente, - "%c", "%c", que imprime um número de ponto flutuante em notação geral, - "%c", "%c", que imprime um número de ponto flutuante em notação hexadecimal. Além disso, há a diretiva "%s", que imprime um único "%c".

source: If a directive specifies the argument by its number ('%s' notation), all directives that consume an argument must do so.
hr: Ako jedna direktiva specificira argument sa svojim brojem (‘%s’ notacija), onda sve direktive koje koriste argument moraju tako postupiti.
pt: Se uma directiva especifica o argumento pelo seu número (notação "%s"), todas as directivas que consomem um argumento terão também de o fazer.
pt_br: Se uma diretiva especifica os argumentos pelo seu número (notação "%s"), todas as diretivas que consomem um argumento também devem.
